Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/examples.po
Languages: fr

source: Example data to test the package :mod:`cuspy`
fr: Données d'exemple pour tester le paquet :mod:`cuspy`

source: You can test the application with example data provided in the folder :file:`example_data` and the OKP model implemented in the :mod:`okplm` package. Several scripts that use these data and model are also available in the folder :file:`tests`.
fr: Vous pouvez tester le logiciel à l'aide des données d'exemple fourniesdans le dossier :file:`example_data` et le modèle OKP implementé dans le paquet :mod:`okplm`. Plusieurs scripts qu'utilisent ces données et modèle sont disponibles aussi dans le dossier :file:`tests`.

source: The data
fr: Les données

source: The lake data in the :file:`lake.txt` file corresponds to the Lake Allos (lake code = ALL04).
fr: Les données de lac dans le fichier :file:`lake.txt` correspondent au lac d'Allos (code de lac = ALL04).

source: The meteorological data (:file:`meteo.txt`) is synthetic data based on meteorological data. Air temperature has been created using a seasonal component and an ARMA model, while solar radiation data corresponds to the seasonal component only.
fr: Les données météorologiques (:file:`meteo.txt`) sont des données synthetiques créées depuis des données météorologiques. La température de l'air a été créée à l'aide d'une composante saisonnière et un modèle ARMA, tandis que les données de rayonnement solaire correspondent seulement à la composante saisonnière

source: The observations in the files :file:`obs.txt` and :file:`pred.txt` are fictitious and their only aim is to verify the package is working correctly and to help learn its usage.
fr: Les observations dans les fichiers :file:`obs.txt` et :file:`pred.txt` sont fitives et leur seul but est de vérifier le correct fonctionnement du paquet et d'aider dans l'apprentissage de son utilisation.

source: The folder also contains three files containing observation names (:file:`obs_names.txt`), observation group names (:file:`obs_groups.txt`) and observation weights (:file:`obs_weights.txt`).
fr: Dans le dossier il y a aussi trois fichiers qui contiennent les noms des observations (:file:`obs_names.txt`), les noms des groupes d'observations (:file:`obs_groups.txt`) et les poids des observations (:file:`obs_weights.txt`).

source: The scripts
fr: Les scripts

source: The folder :file:`tests` contains several scripts that can be used to test the package functionalities. Each script illustrates how to make different types of analysis.
fr: Le dossier :file:`tests` contient plusieurs scripts permettant de tester les fonctionnalités du paquet. Chaque script démontre comment faire différents types d'analyses.

source: The included scripts are:
fr: Les scripts inclus sont:

source: :file:`test_0_input.py`: it illustrates input file management.
fr: :file:`test_0_input.py`: il démontre la gestion des fichiers d'entrée.

source: :file:`test_1_overdet.py`: it provides examples of calibration in the overdetermined case, with GLM or DE algorithms.
fr: :file:`test_1_overdet.py`: il donne des exemples de calibration dans le cas surdéterminé, avec les algorithmes GLM ou DE.

source: :file:`test_2_calib_reg.py`: it provides an example of calibration in the under-determined case, using Tikhonov regularisation.
fr: :file:`test_2_calib_reg.py`: il donne un exemple de calibration dans le cas sous-déterminé, en utilisant la régularisation de Tikhonov.

source: :file:`test_3_sensitivity.py`: it exemplifies the realisation of a global sensitivity analysis.
fr: :file:`test_3_sensitivity.py`: il exemplifie la réalisation d'une analyse de sensitivité globale.

source: :file:`test_4_monte_carlo.py`: it shows how to carry Monte Carlo simulations.
fr: :file:`test_4_monte_carlo.py`: il montre comment faire des simulations de Monte Carlo simulations.

source: :file:`test_5_ies.py`: it shows an application of Iterative Ensemble Smoothing.
fr: :file:`test_5_ies.py`: il montre une application du Lissage Itératif d'Ensemble (Iterative Ensemble Smoothing).

source: :file:`test_6_uncertainty.py`: it shows an example of calibration and uncertainty analysis.
fr: :file:`test_6_uncertainty.py`: il montre un exemple de calibration et d'analyse d'incertitudes.
