Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/installation.po
Languages: fr

source: You need Python 3.6 or later to run the :mod:`cuspy` package. You can have multiple Python versions (2.x and 3.x) installed on the same system without problems using, for example, virtual environments.
fr: Il est nécessaire d'avoir une version Python 3.6 ou ultérieure pour faire tourner le paquet :mod:`cuspy`. Il est possible d'avoir plusieurs versions de Python (2.x et 3.x) installées sur le même système d'exploitation en utilisant, par exemple, les environnements virtuels.

source: You may use ``pip`` to install the required packages.
fr: Vous pouvez utiliser ``pip`` pour installer les paquets requis.

source: In Windows, to use ``pip`` to install the required packages, please verify that the path to ``pip``'s executable file has been added correctly to your environment variable ``PATH``. The address may vary depending on whether you install it for one or all users (e.g., :file:`%USERPROFILE%/AppData/roaming/Python/Python37/scripts` or :file:`C:/Users/MyUserName/AppData/Local/Programs/Python/Python37/Scripts`).
fr: Sous Windows, pour utiliser ``pip`` pour installer les paquets requis, veuillez vérifier que le chemin au fichier exécutable de ``pip`` a été ajouté correctement à votre variable d'environnement ``PATH``. L'adresse peut varier en fonction de si vous l'installez pour un ou plusieurs utilisateurs (p. ex., :file:`%USERPROFILE%/AppData/roaming/Python/Python37/scripts` ou :file:`C:/Users/MyUserName/AppData/Local/Programs/Python/Python37/Scripts`).

source: The application :mod:`cuspy` depends on the Python packages :mod:`numpy`, :mod:`pandas` and :mod:`pyemu`. The package :mod:`pyemu` also depends on :mod:`matplotlib` for plotting. Make sure they are installed before using :mod:`cuspy`.
fr: Le logiciel :mod:`cuspy` dépend des paquets Python :mod:`numpy`, :mod:`pandas` et :mod:`pyemu`. Le paquet :mod:`pyemu` dépend aussi de :mod:`matplotlib` pour tracer des graphiques. Assurez-vous qu'ils sont installés avant l'utilisation de :mod:`cuspy`.

source: In addition, :mod:`cuspy` relies on the use of the PEST++ executables. PEST++ executables for Windows are available at https://github.com/usgs/pestpp/bin/win, but you will need to compile them for Linux (see the instructions below, `Compiling PEST++ executables`_).
fr: De plus, :mod:`cuspy` utilise les exécutables de PEST++. Les exécutables de PEST++ pour Windows are sont disponibles sur https://github.com/usgs/pestpp/bin/win, mais pour Linux vous devrez les compiler (voir les instructions dessous, `Compilation des exécutables de PEST++`_).

source: If you do not have to compile the documentation, :mod:`sphinx` is not necessary to use :mod:`cuspy`, since a precompiled pdf copy of the documentation is included in the folder :file:`docs`.
fr: Si vous ne devez pas compiler la documentation, :mod:`sphinx` n'est pas nécessaire pour utiliser :mod:`cuspy`, puisque une copie déjà compilée de la documentation en pdf est incluse dans le dossier :file:`docs`.

source: If you need to compile the documentation from source (e.g., to modify it), you will need the package :mod:`sphinx`. To install :mod:`sphinx` just make:
fr: Si vous avez besoin de compiler la documentation depuis le code source (p. ex., parce que vous avez fait des modifications), vous aurez besoin du paquet :mod:`sphinx`. Pour installer :mod:`sphinx` simplement faites

source: The package :mod:`sphinx` works by default with reStructuredText documents. However, it can also recognise Markdown by installing the Markdown parser :mod:`recommonmark`.
fr: Le paquet :mod:`sphinx` travaille par défaut avec documents de type reStructuredText. Mais il peut aussi reconnaître le formatage Markdown si on installe le parseur Markdown :mod:`recommonmark`.

source: To create multilingual documentation, you will need the package :mod:`sphinx-intl`. The installation process is as above:
fr: Pour créer documentation multilingue, vous avez besoin du paquet :mod:`sphinx-intl`. Le procès d'installation est comme ci-dessus :

source: To compile pdf documents (only in Linux), you will also need to have installed latex and the Python package :mod:`latexmk`. To install latex, type:
fr: Pour compiler documents pdf (seulement sous Linux), il vous faudra installer aussi latex et le paquet Python :mod:`latexmk`. Pour installer latex, tapez :

source: And to install :mod:`latexmk`, type:
fr: Et pour installer :mod:`latexmk`, tapez :

source: On Ubuntu you may use:
fr: Sur Ubuntu vous pouvez utiliser :

source: Cloning repositories
fr: Clonage du répertoire

source: You need to clone the :mod:`cuspy` package and :mod:`pestpp` source with git. For this go to an appropriate directory (e.g., :file:`pathtoprojectsfolder`) where to copy the project's code in a subfolder and clone the project. For example, for :mod:`cuspy`:
fr: Vous devez cloner les paquets :mod:`okplm` et :mod:`pestpp` avec git. Pour ça, placez-vous dans un dossier approprié (p. ex., :file:`pathtoprojectsfolder`) où copier dans un sous-dossier le code du projet et clonez le projet : Par exemple, pour :mod:`cuspy`:

source: This command creates the :mod:`cuspy` repertory in the folder :file:`pathtoprojectsfolder`.
fr: Cette commande crée le répertoire :mod:`okplm` dans le dossier :file:`pathtoprojectsfolder`.

source: To install the development branch of the project, after cloning the :mod:`cuspy` package, change to the ``dev`` branch:
fr: Pour installer la branche de développement du projet, changez à la branche ``dev`` après avoir cloné le paquet :mod:`cuspy` package :

source: To clone the ``pestpp`` source, do:
fr: Pour cloner le code source de ``pestpp``, faites :

source: Compiling PEST++ executables
fr: Compilation des exécutables de PEST++

source: If you work on Linux, you need to compile the PEST++ executables. For this you will need to have ``gcc``, ``gfortran`` and the libraries ``lapack`` and ``blas`` installed. To install them you can use:
fr: Si vous travaillez sous Linux, vous devrez compiler les exécutables de PEST++. Pour ça vous avez besoin d'avoir ``gcc``, ``gfortran`` et les librairies ``lapack`` et ``blas`` installés sur votre ordinateur. Pour les installer vous pouvez utiliser :

source: To compile the PEST++ executables, go to the :file:`pestpp/src` folder and do:
fr: Pour compiler les exécutables de PEST++, allez au dossier :file:`pestpp/src` et faites :

source: The compiled executables can then be found in the folder :file:`pestpp/bin/linux`.
fr: Les exécutables compilés se trouvent alors dans le dossier :file:`pestpp/bin/linux`.

source: Installing :mod:`cuspy`
fr: Installation de :mod:`cuspy`

source: To install :mod:`cuspy`, go to the repertory created during the cloning of the package :mod:`cuspy` (e.g., :file:`pathtorepertorycuspy`) and install it using ``pip``:
fr: Pour installer :mod:`cuspy`, allez au répertoire créé pendant le clonage de :mod:`cuspy` (p. ex., :file:`pathtorepertorycuspy`) et installe-le avec ``pip``.

source: Compilation of the project documentation
fr: Compilation de la documentation du projet

source: The source files for the project user manual are stored in the folder :file:`pathtorepertorycuspy/sphinx-doc/source`. Sphinx also extracts data from the project modules docstrings.
fr: Les fichiers source du manuel d'utilisation du projet sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/source`. Sphinx extrait aussi des données des docstrings des modules du projet.

source: Documentation in English
fr: Documentation en anglais

source: To compile the user manual in English as html files go to the folder :file:`pathtorepertorycuspy/sphinx-doc` and type:
fr: Pour compiler le manuel d'utilisation en anglais en html allez au dossier :file:`pathtorepertorycuspy/sphinx-doc` et tapez :

source: The output html files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build/html`.
fr: Les fichiers html de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build/html`.

source: You can also compile the user manual as a pdf file making:
fr: Vous pouvez compiler aussi le manuel d'utilisation en pdf avec :

source: The source documentation files are converted to latex and then to pdf. The output latex and pdf files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build/latex`.
fr: Les fichiers source de la documentation sont convertis à latex et après à pdf. Les fichiers latex et pdf de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build/latex`.

source: Documentation in French
fr: Documentation en français

source: To compile the user manual in French as html files go to the folder :file:`pathtorepertorycuspy/sphinx-doc` and type:
fr: Pour compiler le manuel d'utilisation en français en html allez au dossier :file:`pathtorepertorycuspy/sphinx-doc` et tapez :

source: The output html files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build_fr/html`.
fr: Les fichiers html de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build_fr/html`.

source: To compile the pdf documentation, type the following commands:
fr: Pour compiler la documentation en pdf, tapez les commandes suivantes :

source: The source documentation files are converted to latex and then to pdf. The output latex and pdf files are saved in the folder :file:`pathtorepertorycuspy/sphinx-doc/build_fr/latex`.
fr: Les fichiers source de la documentation sont convertis à latex et après à pdf. Les fichiers latex et pdf de sortie sont stockés dans le dossier :file:`pathtorepertorycuspy/sphinx-doc/build_fr/latex`.
