Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/modules.po
Languages: fr

source: This module contains the following function:
fr: Ce module contient les fonctions suivantes :

source: :func:`launch_pestpp`: launch PEST++ executable
fr: :func:`launch_pestpp`: lance l'exécutable PEST++

source: Launch PEST++ executable.
fr: Lance l'exécutable PEST++.

source: This function launches the requested PEST++ executable, either making calculations on line or in parallel. The PEST++ executables and uses are:
fr: Cette fonction lance l'exécutable PEST++ sollicité, soit faisant les calcules en séquentiellement ou en parallèle. Les exécutables de PEST++ et leurs utilisations sont :

source: PESTPP-GLM: highly parameterized inversion and global optimization (i.e., parameter optimization, calibration).
fr: PESTPP-GLM: inversion avec un grand nombre de paramètres et optimisation globale (c'est-à-dire, optimisation de paramètres, calibration).

source: PESTPP-SEN: global sensitivity analysis.
fr: PESTPP-SEN: analyse de sensitivité globale.

source: PESTPP-OPT: constrained optimization under uncertainty (White et al. 2018).
fr: PESTPP-OPT: optimisation contrainte sous incertitude (White et al. 2018).

source: PESTPP-IES: interative ensemble smoothing (White 2018).
fr: PESTPP-IES: lissage itératif d'ensemble (White 2018).

source: PESTPP-SWP: Monte Carlo simulations.
fr: PESTPP-SWP: simulations de Monte Carlo.

source: For more details on the PEST++ executables, please see White et al. (2019).
fr: Pour plus d'information sur les exécutables de PEST++, veuillez voire White et al. (2019).

source: path of pest control file (.pst).
fr: chemin du fichier de contrôle pest (.pst).

source: folder containing the PEST++ executables.
fr: dossier qui contient les exécutables de PEST++.

source: PEST++ executable. The PEST++ executables are: "pestpp-glm", "pestpp-sen", "pestpp-opt", "pestpp-ies" and "pestpp-swp".
fr: Exécutable de PEST++. Les exécutables de PEST++ sont: "pestpp-glm", "pestpp-sen", "pestpp-opt", "pestpp-ies" et "pestpp-swp".

source: parallelize calculations.
fr: parallélise les calculs.

source: The output of the PEST++ command is shown on screen. In addition, the `pestpp_cmd` output files are written in the folder containing the `pst_file`.
fr: Le retour de l'instruction de PEST++ es montrée sur l'écran. De plus, les fichiers de sortie de `pestpp_cmd` sont écrit dans le dossier qui contient le `pst_file`.

source: Functions to make analyses based on PEST++.
fr: Fonctions pour réaliser des analyses basées sur PEST++.

source: The functions in this module carry the different type of analyses implemented in the package.
fr: Les fonctions dans ce module réalisent les différents types d'analyse implémentées dans le paquet.

source: :func:`calibration`: calibrate model.
fr: :func:`calibration` : calibre le modèle.

source: :func:`gsa`: Global Sensitivity Analysis.
fr: :func:`gsa` : Analyse de Sensitivité Globale.

source: :func:`ies`: Iterative Ensemble Smoother.
fr: :func:`ies` : Lissage Itératif d'Ensemble.

source: :func:`linear_uncertainty`: predictive uncertainty.
fr: :func:`linear_uncertainty` : incertitude prédictive.

source: :func:`monte_carlo`: Monte Carlo simulations.
fr: :func:`monte_carlo` : simulation de Monte Carlo.

source: Calibrate model (GLM or DE methods).
fr: Calibre le modèle (méthodes GLM ou DE).

source: method used to calibrate the model. It is 'glm' for the Gauss-Levenberg-Marquardt algorithm, 'de' for differential evolution.
fr: méthode utilisée pour calibrer le modèle. C'estI 'glm' pour l'algorithme de Gauss-Levenberg-Marquardt, 'de' pour évolution différentielle.

source: use Tikhonov regularisation.
fr: utilise la régularisation de Tikhonov.

source: path of original pest file.
fr: chemin du fichier pest originel.

source: path of modified pest file.
fr: chemin du fichier pest modifié.

source: a dictionary defining options in the control data section of the pest file.
fr: un dictionnaire où sont définies les options de la section de contrôle du fichier de contrôle pest.

source: a dictionary used to pass options to the svd section of the pest file.
fr: un dictionnaire utilisé pour configurer des options de la section SVD du fichier de contrôle PEST.

source: a dictionary used to pass options to the regularization section of the pest file.
fr: un dictionnaire utilisé pour configurer des options de la section de régularisation du fichier de contrôle PEST.

source: a dictionary used to pass options to configure the DE method.
fr: un dictionnaire utilisé pour configurer les options de la méthode DE.

source: parallelize model runs.
fr: parallélise les exécutions du modèle.

source: A pest instance where the parameter values correspond to the calibrated values. A pest file (`pst_file1`) and associated files containing the results of the calibration process are also created.
fr: Une instance PEST où les valeurs des paramètres correspondent aux valeurs calibrées. Un fichier PEST (`pst_file1`) et les fichiers associés qui contiennent les résultats du procès de calibration sont créés aussi.

source: This function calls the PEST++ executable `pestpp-glm`.
fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-glm`.

source: Carry global sensitivity analysis (Morris or Sobol methods).
fr: Réalise une analyse de sensitivité globale (méthode de Morris ou de Sobol).

source: 'morris' for Morris's method (one parameter at a time) or 'sobol' for Sobol's method.
fr: 'morris' pour la méthode de Morris (un paramètre à la fois) ou 'sobol' pour la méthode de Sobol.

source: a dictionary used to pass options to configure the GSA method.
fr: un dictionnaire utilisé pour configurer les options de la méthode GSA.

source: A modified pst file and associated files containing results.
fr: Un fichier pst modifié et ses fichiers associés qui contiennent les résultats.

source: This function calls the PEST++ executable `pestpp-sen`.
fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-sen`.

source: Iterative Ensemble Smoother.
fr: Lissage Itératif d'Ensemble.

source: number of realizations.
fr: nombre de réalisations.

source: name of prior parameter covariance file. If None, parameter covariance is estimated from parameter bounds.
fr: nom du fichier de covariance des paramètres a priori. Si None, la covariance des paramètres est estimée depuis le rang de valeurs des paramètres.

source: a dictionary containing additional options to pass to `pestpp-ies`.
fr: un dictionnaire qui contient options additionnelles à passer à `pestpp-ies`.

source: A modified pest control file and the associated output files.
fr: Un fichier de contrôle PEST modifié et ses fichiers de sortie associés.

source: This function calls the PEST++ executable `pestpp-ies`.
fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-ies`.

source: White, J. T. (2018) A model-independent iterative ensemble smoother for efficient history-matching and uncertainty quantification in very high dimensions. *Environmental Modelling & Software*, 109, 191-201.
fr: White, J. T. (2018) A model-independent iterative ensemble smoother for efficient history-matching and uncertainty quantification in very high dimensions. *Environmental Modelling and Software* 109, 191-201.

source: Carry linear uncertainty calculations.
fr: Réalise les calculs linéaires d'incertitude.

source: Type of predictive uncertainty analysis. It can take the values 'schur', for Schur's complement analysis for conditional uncertainty propagation; 'err_var', for error variance analysis; or 'prior', prior uncertainty estimation.
fr: Type d'analyse d'incertitudes prédictives. Il peut prendre les valeurs 'schur', pour l'analyse du complément de Schur pour la propagation conditionnelle d'incertitudes ; 'err_var', pour l'analyse de la variance de l'erreur ; ou 'prior', pour l'estimation de l'incertitude a priori.

source: Path of the original pest file.
fr: chemin du fichier pest originel.

source: Path of the modified pest file.
fr: chemin du fichier pest modifié.

source: list of predictions names. If None, predictions are read from the `pst_file0` as the observations with null weight.
fr: liste de noms des prédictions. Si None, les prédictions sont lues depuis le fichier `pst_file0` comme observations avec un poids nul.

source: A :class:`LinearAnalysis` object (``analysis='prior'``), a :class:`Schur` object (``analysis='schur'``) or an :class:`ErrVar` object (``analysis='err_var'``). A modified PEST control file (`pst_file1`) and a Jacobian matrix file are also created file in the process.
fr: Un objet :class:`LinearAnalysis` (``analysis='prior'``), un objet :class:`Schur` (``analysis='schur'``) ou un objet :class:`ErrVar` (``analysis='err_var'``). Un fichier de contrôle PEST modifié (`pst_file1`) et une matrice de Jacobi sont aussi créés pendant le procès.

source: It is supposed that the model has already been calibrated. Thus, the original PEST control file `pst_file0` should be in the same folder as the files created during the calibration process.
fr: On suppose que le modèle a déjà été calibré. Ainsi, le fichier de contrôle PEST originel `pst_file0` devrait être dans le même dossier que les fichiers créés pendant le procès de calibration.

source: White, J.T.; Fienen, M.N.; Doherty, J.E. (2016) A python framework for environmental model uncertainty analysis. *Environmental Modelling & Software*, 85, 217-228.
fr: White, J.T.; Fienen, M.N.; Doherty, J.E. (2016) A python framework for environmental model uncertainty analysis. *Environmental Modelling and Software* 85, 217-228.

source: Monte Carlo simulations.
fr: Simulations de Monte Carlo.

source: type of distribution; 'prior' for prior distribution or 'post' for posterior distribution.
fr: type de distribution ; 'prior' pour une distribution a priori ou 'post' pour une distribution a posteriori.

source: 'uniform', 'triangular', 'gaussian', 'mixed'. Ignored if ``type = post`` (gaussian distribution used).
fr: 'uniform', 'triangular', 'gaussian', 'mixed'. Ignoré si ``type = post`` (la distribution normale est utilisée).

source: number of samples to draw.
fr: nombre d'échantillons à extraire.

source: dictionary of parameter names (keys) and distributions (values). Only used if ``distribution = mixed``.
fr: dictionnaire de noms des paramètres (clés) et distributions (valeurs). Seulement utilisée si ``distribution = mixed``.

source: name of the file to save the parameter samples.
fr: nom du fichier où sauvegarder les échantillons de valeurs des paramètres.

source: add the `pst_file0` parameter values as a realization.
fr: ajoute les valeurs des paramètres du fichier `pst_file0` comme une réalisation.

source: a dictionary used to pass options to configure the `pestpp-swp` options.
fr: un dictionnaire utilisé pour configurer les options de `pestpp-swp`.

source: option to process the sweep_out.csv results file. Observation group names should correspond to the names of the variables to which the observations belong.
fr: option pour traiter le fichier de résultats :file:`sweep_out.csv`. Les noms des groupes d'observations devraient correspondre aux noms des variables auxquelles les observations appartiennent.

source: This function calls the PEST++ executable `pestpp-swp`.
fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-swp`.
