Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/modules.po
Languages: fr

source: Functions to read and write data.
fr: Fonctions pour lire et écrire des données.

source: The functions in this module are used to manage reading and writing of input and output files.
fr: Les fonctions de ce module servent à lire et écrire des fichiers d'entrée et sortie.

source: This module contains the following functions:
fr: Ce module contient les fonctions suivantes :

source: :func:`get_obs_data`: Get observation data.
fr: :func:`get_obs_data`: Obtient des données observées.

source: :func:`process_sweep_out`: Process file :file:`sweep_out.csv`.
fr: :func:`process_sweep_out`: Traite fichier :file:`sweep_out.csv`.

source: :func:`write_dict`: Write dictionary to file.
fr: :func:`write_dict`: Écrit un dictionnaire à un fichier.

source: :func:`write_dummy_pred_file`: Write a predictions file with dummy values.
fr: :func:`write_dummy_pred_file`: Écrit un fichier de prédictions avec des valeurs fictives.

source: :func:`write_ins_file`: Write PEST instruction file.
fr: :func:`write_ins_file`: Écrit le fichier PEST d'instructions.

source: :func:`write_pest_files`: Writes PEST files.
fr: :func:`write_pest_files`: Écrit les fichiers de PEST.

source: :func:`write_par_data_file`: Write parameter data file.
fr: :func:`write_tpl_file`: Écrit le fichier de paramètres modèle de PEST.

source: :func:`write_tpl_file`: Write PEST template parameter file.
fr: :func:`write_tpl_file`: Écrit le fichier de paramètres modèle de PEST.

source: Get observation data
fr: Obtient données observées

source: This function is used to read data (observations or predictions) from a file. It is also used to group data and to assign names and weights to data. In PEST parlance "observations" correspond to measurements already made (usually with weight > 0), and "predictions" (or "forecasts") correspond to data we intend to forecast (with weight = 0).
fr: Cette fonction sert à lire des données (observations ou prédictions) depuis un fichier. Il est utilisé aussi pour grouper des données et pour assigner des noms et poids aux données. Dans la terminologie utilisée par PEST les "observations" correspondent à mesures déjà réalisées (d'habitude avec un poids > 0), et les "prédictions" (ou "prévisions") correspondent aux données que nous voulons prédire (avec poids = 0).

source: Parameters
fr: Paramètres

source: path of the observations file (it should have the same format as the model output file). Missing values may be indicated with NA, na or NaN. The first column contains dates in the format "YYYY-mm-dd".
fr: chemin du fichier d'observations (il devrait avoir le même format que le fichier de sortie du modèle). Les valeurs manquantes peuvent être indiquées avec NA, na ou NaN. La première colonne contient les dates avec le format "AAAA-mm-jj".

source: date of start of simulation (in the format "YYYY-mm-dd").
fr: date de début de la simulation avec le format 'AAAA-mm-jj'.

source: date of end of simulation (in the format "YYYY-mm-dd").
fr: date de finalisation de la simulation avec le format 'AAAA-mm-jj'.

source: str or float. If str, it indicates the path to a file with the same format and column names as obs_file containing weights for each measurement. If float, it indicates a weight to apply to all measurements.
fr: str ou float. Si c'est str, l'argument indique le chemin à un fichier avec les mêmes format et nom des colonnes que obs_file et qui contient les poids pour chaque mesure. Si c'est float, il indique un poids à appliquer à toutes les mesures.

source: it can be a path, a string or 'default'. If it is a path, group names are read from a file with the same format and column names as obs_file. If 'default', observations are grouped by variable name. If another str, all observations are assigned to the same group.
fr: peut être un chemin, une chaîne de caractères ou 'default'. si c'est un chemin, les noms des groupes sont lus depuis un fichier avec les mêmes format et noms de colonnes que obs_file. Si c'est 'default', les observations sont groupées par nom de variable. Si c'est une autre str, toutes les observations sont assignées au même groupe.

source: it can be a path, a string or 'default'. If it is a path, observation names are read from a file with the same format and column names as obs_file. If 'default', observations names have the format xxxx_YYYYmmdd (xxxx is the corresponding variable name, and YYYYmmdd is a date string). If another str, the observation names have the format obsnamesNN, where NN is the index of the observation in the resulting dataframe.
fr: peut être un chemin, une chaîne de caractères ou 'default'. Si c'est un chemin, les noms des observations sont lus depuis un fichier avec les mêmes format et noms des colonnes que obs_file. Si c'est 'default', les noms des observations ont le format xxxx_AAAAmmjj (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date). Si c'est une autre str, les noms des observations ont le format obsnamesNN, où NN est l'index de l'observation dans le dataframe créé.

source: column delimiter used in the files read by the function.
fr: délimiteur des colonnes utilisé dans les fichiers lus par la fonction.

source: Returns
fr: Retour

source: A pandas dataframe containing the row and column indexes of observations in the output file, the observation names and groups, and their weights.
fr: Un dataframe pandas qui contient les indexes des files et colonnes des observations dans le fichier de sortie, les noms et groupes des observations, et leur poids.

source: Process file :file:`sweep_out.csv`.
fr: Traite le fichier :file:`sweep_out.csv`.

source: Path of the :file:`sweep_out.csv` file, created when making Monte Carlo simulations.
fr: Chemin du fichier :file:`sweep_out.csv`, créé quand on réalise des simulations de Monte Carlo simulations.

source: List of variable names.
fr: Liste des noms des variables.

source: Folder where the processed data will be written.
fr: Dossier où écrire les données traitées.

source: Dictionary of variable names for which partial averages will be calculated. The keys indicate the variables used to group data into percentiles; the values are lists of variables names for which partial averages will be calculated for each of the percentile groups of the key variable.
fr: Dictionnaire de noms des variables pour lesquelles des moyennes partielles seront calculées. Les clés indiquent les variables utilisées pour grouper les données par percentiles; les valeurs sont listes des noms des variables pour lesquelles des moyennes partielles seront calculées pour chaque groupe de la variable clé.

source: A series of text files containing the base simulation, the minimum, maximum, and the percentiles 5%, 25%, 50%, 75% and 95% of the simulations in the :file:`sweep_out.csv` file. The names of the output files follow the pattern "mc_uncert_<v>.txt", where `v` is the name of the output variable as used in :file:`sweep_out.csv`. In addition, if `ptl_avg` is specified, another series of files is created, which contains the partial averages of one variable (`vpa`) by percentile group of another variable (`v`). In this case, the output files follow the pattern "mc_pavg_<vpa>_by_<v>.txt".
fr: Une série de fichiers texte qui contiennent la simulation de base, le minimum, le maximum et les percentiles 5%, 25%, 50%, 75% et 95% des simulations dans le fichier :file:`sweep_out.csv`. Les noms des fichiers de sortie suivent le modèle "mc_uncert_<v>.txt", où `v` est le nom de la variable de sortie telle quelle est utilisée dans :file:`sweep_out.csv`. De plus, si `ptl_avg` est spécifiée, une autre série de fichiers est créée, contenant les moyennes partielles d'une variable (`vpa`) par groupe de percentile d'une autre variable (`v`). Dans ce cas, les fichiers de sortie suivent le modèle "mc_pavg_<vpa>_by_<v>.txt".

source: Write dictionary to file.
fr: Écrit dictionnaire à un fichier.

source: This function writes a Python dictionary to a file. The file is organised in two columns, the first containing keys, and the second one containing values.
fr: Cette fonction écrit un dictionnaire Python à un fichier. Le fichier est organisé en deux colonnes, la première contient les clés et la seconde contient les valeurs.

source: a Python dictionary.
fr: un dictionnaire Python.

source: path of the text file to write the data.
fr: chemin du fichier texte où écrire les données.

source: A file located at `path` where the dictionary data is written.
fr: Un fichier situé à "path" où le contenu du dictionnaire data est écrit.

source: Write predictions file filled with dummy values.
fr: Écrit un fichier de prédictions avec des valeurs fictives.

source: File name.
fr: Nom du fichier.

source: List or array of time stamps corresponding to the data in the predictions file.
fr: Liste ou array de données de temps correspondantes aux données dans le fichier de prédictions.

source: Nomes of the columns in the predictions file.
fr: Noms des colonnes du fichier de prédictions.

source: Name of the column containing time data (provided through the argument `time_stamps`.
fr: Nom de la colonne qui contient les données de temps (données par le biais de l'argument `time_stamps`).

source: Value used to fill the predictions file (except time data).
fr: Valeur utilisée pour remplir le fichier de prédictions (à exception des données de temps).

source: Column separator of the output file.
fr: Séparateur de colonnes du fichier de sortie.

source: A file with the same format as the output file, filled with dummy values.
fr: Un fichier avec le même format que le fichier de sortie, rempli avec des données fictives.

source: A predictions file filled with dummy values may be useful when it is necessary to obtain simulation results for a certain period and there are no observations available.
fr: Un fichier de prédictions rempli avec des données fictives peut être utile quand on veut obtenir des résultats de simulation pour une période de temps pour lequel il n'y a pas d'observations disponibles.

source: Write PEST instruction file.
fr: Écrit le fichier PEST d'instructions.

source: This function is used to write a PEST(++) instruction file, a text file used to specify how PEST should read a model's output file. Detailed instructions on how to format an instructions file can be found in White et al. (2019).
fr: Cette fonction sert à écrire un fichier d'instructions de PEST(++), un fichier texte utilisé pour spécifier comment PEST doit lire le fichier de sortie d'un modèle. Des instructions détaillées sur comment formater un fichier d'instructions peuvent être trouvées dans White et al. (2019).

source: a file name. It is recommended to use the extension .ins.
fr: un nom de fichier. Il est conseillé d'utiliser l'extension .ins.

source: list of tuples (x, y, obsname) indicating the row index (x), column index (y) and name (obsname) corresponding to observations in the model output file.
fr: liste de tuples (x, y, obsname) qui indique l'index des files (x), l'index des colonnes (y) et le nom (obsname) qui correspond aux observations dans le fichier de sortie du modèle.

source: list of tuples (x, y, obsname) indicating the row index (x), column index (y) and name (obsname) corresponding to predictions in the model output file.
fr: liste de tuples (x, y, obsname) qui indique l'index des files (x), l'index des colonnes (y) et le nom (obsname) qui correspond aux prédictions dans le fichier de sortie du modèle.

source: number of columns of the output file.
fr: nombre de colonnes du fichier de sortie.

source: number of lines of the file header.
fr: nombre de lignes de l'entête du fichier.

source: width of the field in characters. It must be at least as long as the observation/prediction name.
fr: largeur du champ en nombre de caractères. Il doit être au moins si long que le nom de l'observation/prédiction.

source: delimiter character used in the output file.
fr: caractère délimiteur utilisé dans le fichier de sortie.

source: A PEST(++) instruction file (a text file specifying how to process a model output file to read the simulation results corresponding to the observations and predictions of interest).
fr: Un fichier d'instruction PEST(++) (un fichier texte qui spécifie comment traiter la sortie d'un modèle pour lire les résultats de simulation qui correspondent aux observations et prédictions d’intérêt).

source: References
fr: Références

source: Write parameter data file.
fr: Écrit le fichier de données des paramètres.

source: List of names of the parameters.
fr: Liste de noms des paramètres.

source: List of initial values of the parameters.
fr: Liste des valeurs initiales des paramètres.

source: List of lower bounds of the parameters.
fr: Liste des seuils inférieurs des paramètres.

source: List of upper bounds of the parameters.
fr: Liste des seuils supérieurs des paramètres.

source: Transformation applied to all the parameters or list of transformations applied to each parameter. The possible values are "none", "log", "fixed" or "tied".
fr: Transformation appliquée à tous les paramètres ou liste de transformations appliquées pour chaque paramètre. Les valeurs possibles sont "none", "log", "fixed" or "tied".

source: Type of parameter change limit (value to apply to all the parameters or list of values). The possible values are: "relative" and "factor".
fr: Type de limite de changement du paramètre (valeur à appliquer à tous les paramètres ou liste de valeurs). Les valeurs possibles sont : "relative" et "factor".

source: List of parameter group names. If None, the parameter group names are the same as the parameter names (one parameter group for each parameter).
fr: Liste de noms des groupes de paramètres. Si c'est None, les noms des groupes de paramètres sont les mêmes que les noms des paramètres (un groupe de paramètres pour chaque paramètre).

source: Multiplier of list of multipliers of the parameter values.
fr: Multiplicateur ou liste de multiplicateurs des valeurs des paramètres.

source: Offset or list of offsets to aplly to the parameter values.
fr: Écart ou liste d'écarts à appliquer aux valeurs des paramètres.

source: Number (or list of numbers) of the command line used to calculate the derivatives of the parameters. It is usually equal to 1.
fr: Numéro (ou liste de numéros) de la ligne de commande utilisée pour calculer les dérivées des paramètres. C'est d'habitude égal à 1.

source: Path of the parameter data file where the data will be written.
fr: Chemin du fichier de données des paramètres où écrire les données.

source: Write PEST files
fr: Écrit les fichiers de PEST.

source: The function :func:`write_pest_files` is used to write the files necessary to run programs of the PEST(++) suite. This includes the control file, instructions file and template parameter file. For more information on the files used by PEST++, please see White et al. (2019).
fr: La fonction :func:`write_pest_files` sert à écrire les fichiers nécessaires pour tourner des programmes de PEST(++). Ces fichiers incluent le fichier de contrôle, le fichier d'instructions et le fichier de paramètres modèle. Pour plus d'information sur les fichiers utilisés par PEST++, veuillez voire White et al. (2019).

source: date of start of simulations in str format ('YYYY-mm-dd') or datetime-like format.
fr: date de début des simulations avec le format str 'AAAA-mm-jj' ou similaire à un format datetime.

source: date of end of simulations in str format ('YYYY-mm-dd') or datetime-like format.
fr: date de finalisation des simulations avec le format str 'AAAA-mm-jj' ou similaire à un format datetime.

source: command used to run the model.
fr: instruction utilisée pour faire tourner le modèle.

source: path of the model's parameter file. It is written by the function using the parameter values in `par_data_file`.
fr: chemin du fichier de paramètres du modèle. Il est écrit par la fonction en utilisant les valeurs des paramètres dans `par_data_file`.

source: path of the model's output file.
fr: chemin du fichier de sortie du modèle.

source: path of a file containing parameter data to configure the parameter section of the PEST control file.
fr: chemin d'un fichier qui contient des données sur les paramètres nécessaires à configurer la section dédiée aux paramètres dans le fichier de contrôle de PEST.

source: path of the observations file. It has the same format as `output_file`.
fr: chemin du fichier d'observations. Il a le même format que `output_file`.

source: path of the predictions file. It has the same format as `output_file`.
fr: chemin du fichier de prédictions. Il a le même format que `output_file`.

source: weights assigned to observations. It can be str or float. If str, it indicates the path to a file with the same format and column names as `obs_file` containing weights for each measurement. If float, it indicates a weight to apply to all measurements.
fr: poids assignés aux observations. Il peut être str ou float. Si c'est str, l'argument indique le chemin à un fichier avec les mêmes format et nom des colonnes que obs_file et qui contient les poids pour chaque mesure. Si c'est float, il indique un poids à appliquer à toutes les mesures.

source: groups to which each observation is assigned. It can be a path, a string or 'default'. If it is a path, group names are read from a file with the same format and column names as `obs_file`. If 'default', observations are grouped by variable name. If another str, all observations are assigned to the same group.
fr: groupes auxquels chaque observation est assignée. Peut être un chemin, une chaîne de caractères ou 'default'. Si c'est un chemin, les noms des groupes sont lus depuis un fichier avec les mêmes format et noms de colonnes que `obs_file`. Si c'est 'default', les observations sont groupées par nom de variable. Si c'est une autre str, toutes les observations sont assignées au même groupe.

source: observation names. It can be a path, a string or 'default'. If it is a path, observation names are read from a file with the same format and column names as `obs_file`. If 'default', observation names have the format "xxxx_YYYYmmdd" (xxxx is the corresponding variable name, and YYYYmmdd is a date string). If another str, the observation names have the format "obs_namesNN", where NN is the index of the observation in the resulting dataframe.
fr: noms des observations. Peut être un chemin, une chaîne de caractères ou 'default'. Si c'est un chemin, les noms des observations sont lus depuis un fichier avec les mêmes format et noms des colonnes que `obs_file`. Si c'est 'default', les noms des observations ont le format "xxxx_AAAAmmjj" (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date). Si c'est une autre str, les noms des observations ont le format "obsnamesNN", où NN est l'index de l'observation dans le dataframe créé.

source: groups to which each prediction is assigned. It can be a path, a string or 'default'. If it is a path, group names are read from a file with the same format and column names as `obs_file`. If 'default', predictions are grouped by variable name. If another str, all predictions are assigned to the same group.
fr: groupes auxquels chaque prédiction est assignée. Peut être un chemin, une chaîne de caractères ou 'default'. Si c'est un chemin, les noms des groupes sont lus depuis un fichier avec les mêmes format et noms de colonnes que `obs_file`. Si c'est 'default', les prédictions sont groupées par nom de variable. Si c'est une autre str, toutes les prédictions sont assignées au même groupe.

source: prediction names. It can be a path, a string or 'default'. If it is a path, prediction names are read from a file with the same format and column names as `pred_file`. If 'default', prediction names have the format "xxxx_YYYYmmdd" (xxxx is the corresponding variable name, and YYYYmmdd is a date string). If another str, the prediction names have the format "pred_namesNN", where NN is the index of the prediction in the resulting dataframe.
fr: noms des prédictions. Peut être un chemin, une chaîne de caractères ou 'default'. Si c'est un chemin, les noms des prédictions sont lus depuis un fichier avec les mêmes format et noms des colonnes que `pred_file`. Si c'est 'default', les noms des prédictions ont le format "xxxx_AAAAmmjj" (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date). Si c'est une autre str, les noms des prédictions ont le format "pred_namesNN", où NN est l'index de la prédiction dans le dataframe créé.

source: path of the template parameter file. It is written by the function using the parameter names in `par_data_file`.
fr: chemin du fichier de paramètres modèle. Il est écrit par la fonction en utilisant les noms des paramètres dans `par_data_file`.

source: path of the pest instruction file. It is written by the function by using the data in `obs_file` and `pred_file`.
fr: chemin du fichier d'instructions de pest. Il est écrit par la fonction en utilisant les données dans `obs_file` et `pred_file`.

source: path of the PEST control file. It is written by the function using the data it has been passed to it.
fr: chemin du fichier de contrôle PEST. Il est écrit par la fonction en utilisant les données que lui ont été passées.

source: a dictionary defining options in the control data section of the PEST control file.
fr: un dictionnaire où sont définies les de la section de contrôle du fichier de contrôle PEST.

source: a dictionary used to pass options to the SVD section of the PEST control file.
fr: un dictionnaire utilisé pour configurer des options de la section SVD du fichier de contrôle PEST.

source: a dictionary used to pass options to the regularization section of the PEST control file.
fr: un dictionnaire utilisé pour configurer des options de la section de régularisation du fichier de contrôle PEST.

source: a dictionary used to pass PEST++ options to the PEST control file.
fr: un dictionnaire utilisé pour configurer des options de PEST++ du fichier de contrôle PEST.

source: delimiter character used in the `output_file`, `obs_file` and `pred_file`.
fr: caractère délimiteur utilisé dans `output_file`, `obs_file` et `pred_file`.

source: A series of PEST files (control file, instructions file and template parameter file) and a parameter file.
fr: Une série de fichiers PEST (fichier de contrôle, fichier d'instructions et fichier de paramètres modèle) et un fichier de paramètres.

source: Write PEST template parameter file.
fr: Écrit le fichier de paramètres modèle de PEST.

source: This function writes a PEST template parameter file, a text file used to specify the format of the parameter file. The parameter file is a text file where the values of the parameters used by the model are written.
fr: Cette fonction écrit un fichier de paramètres modèle de PEST, un fichier texte utilisé pour spécifier le format du fichier de paramètres. Le fichier de paramètres est un fichier texte où sont écrites les valeurs des paramètres utilisés par le modèle.

source: a file name. It is recommended to use the extension .tpl.
fr: un nom de fichier. Il est conseillé d'utiliser l'extension .tpl.

source: list of parameter names in the order they appear in the parameter file.
fr: liste de noms des paramètres dans l'ordre dans lequel ils se présentent dans le fichier de paramètres.

source: A PEST(++) template parameter file (a text file specifying the format of the parameter file).
fr: Un fichier de paramètres modèle de PEST(++) (un fichier texte qui spécifie le format du fichier de paramètres).

source: Useful functions.
fr: Fonctions d'utilité.

source: The function in this module is used to launch the PEST++ executable.
fr: La fonction dans cette module sert à lancer l'exécutable de PEST++.
