Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/theory.po
Languages: fr

source: The following figure shows the 400 random realizations used to calculate Sobol indexes superimposed on measurements. The figure shows visually that there is a large uncertainty in the value of the parameters :math:`\alpha` and :math:`\beta`, which determine, respectively, the upper asymptote and the inflexion point of the logistic curve.
fr: La figure suivante montre les 400 réalisations aléatoires utilisées pour calculer les indexes de Sobol surimposées aux mesures. La figure montre visuellement qu'il y a une grande incertitude dans la valeur des paramètres :math:`\alpha` et :math:`\beta`, qui déterminent, respectivement, l'asymptote supérieure et le point d'inflexion point de la courbe logistique.

source: In the previous section, we have seen that the parameters :math:`\gamma` and :math:`\mu` are mostly noninfluential. This means that multiple combinations of the values of these parameters results in simulations of similar quality, thus increasing the uncertainty of parameter values. To reduce this uncertainty, we may fix the value of the parameters :math:`\gamma` and :math:`\mu` to their average values, and calibrate the value of the parameters :math:`\alpha` and :math:`\beta`.
fr: Dans la section antérieure on a vu que les paramètres :math:`\gamma` et :math:`\mu` n'ont presque pas d'influence sur les résultats de la simulation. Ceci signifie que plusieurs combinaisons des valeurs des paramètres produisent des simulations de qualité similaire, ce qui fait augmenter l'incertitude des valeurs des paramètres. Pour réduire cette incertitude, on peut fixer la valeur des paramètres :math:`\gamma` et :math:`\mu` sur les valeurs moyennes, et calibrer la valeur des paramètres :math:`\alpha` et :math:`\beta`.

source: The previous process of fixing the value of some parameters is an example of (manual) regularisation, a process by which the complexity of a model is reduced so that the remaining parameters can be estimated uniquely (i.e., with low uncertainty). Other more sophisticated regularisation methods include Tikhonov regularisation and subspace regularisation.
fr: Le procès susdit de fixer la valeur de certains paramètres est un exemple de régularisation (manuelle), une opération par laquelle on réduit la complexité d'un modèle de façon que le reste de paramètres puisse être estimé de façon univoque (i.e., avec une basse incertitude). D'autres méthodes de régularisation plus sophistiqués incluent la régularisation de Tikhonov et la régularisation par sous-espaces.

source: Since there is a great uncertainty on the value of the parameters, we will use Differential Evolution (DE) to make a first calibration. DE is a global calibration method that explores the whole parameter space, rather than a local range of parameter values. Thus this method provides a global optimum.
fr: Comme il y a une grande incertitude par rapport à la valeur des paramètres, nous utiliserons la méthode d'Évolution Différentielle (DE) pour faire une première calibration. La DE est une méthode de calibration globale qui explore l'entier espace des paramètres, plutôt qu'un rang local de valeurs des paramètres. Ainsi cette méthode proportionne un optimum global.

source: After applying a global calibration method it is advisable to refine the calibration with a local method. Thus, we repeat the calibration with the GLM algorithm, but now without fixing the parameters :math:`\gamma` and :math:`\mu`. We can see there is just a slight improvement in RMSE.
fr: Après l'application d'une méthode de calibration globale il est conseillé de raffiner la calibration avec une méthode locale. Ainsi, nous répétons la calibration avec l'algorithme GLM, mais maintenant nous ne fixons plus les paramètres :math:`\gamma` et :math:`\mu`. On peut voire qu'il y a juste une petite amélioration du RMSE.

source: Calibrated values of model parameters
fr: Valeurs calibrées des paramètres du modèle

source: **2.5% confidence value**
fr: **Confidence 2,5 %**

source: **97.5% confidence value**
fr: **Confidence 97,5 %**

source: Posterior uncertainty (Schur's complement analysis)
fr: Incertitude a posteriori (analyse du complément de Schur)

source: Schur's complement analysis is valid when the model has linear (or almost linear) response to variations in the value of the parameters. We already showed above that the model has a nearly linear behaviour in the prior parameter space using Sobol's uncertainty method of decomposition of variance. The following table shows the reduction in parameter uncertainty through calibration according to Schur's complement analysis.
fr: L'analyse du complément de Schur est valide quand le modèle a une réponse linéaire (ou presque linéaire) aux variations de la valeur des paramètres. Nous avons déjà démontré que le modèle a un comportement presque linéaire dans l'espace des paramètres a priori en utilisant la méthode de Sobol de décomposition de la variance. La table suivante montre la réduction d'incertitude des paramètres produite par la calibration d'après l'analyse du complément de Schur.

source: Reduction of parameter uncertainty by calibration
fr: Réduction de l'incertitude des paramètres par calibration

source: **Prior variance**
fr: **Variance a priori**

source: **Posterior variance**
fr: **Variance a posteriori**

source: **Reduction in par. uncertainty (%)**
fr: **Réduction dans l'incertitude des par. (%)**

source: After calibration the uncertainty of the parameters has been much reduced. We note that the reduction in uncertainty for :math:`\mu` is less important than for the other parameters. In fact, this parameter corresponds to the lower asymptote of the logistic curve, but there are few low temperature measurements to inform this parameter.
fr: Après la calibration l'incertitude des paramètres a diminué beaucoup. On peut noter que la réduction dans l'incertitude pour :math:`\mu` est beaucoup moins importante que pour les autres paramètres. En fait, ce paramètre correspond à l'asymptote inférieure de la courbe logistique, mais il y a peu de mesures des basses températures qui puissent apporter information à ce paramètre.

source: The reduction in the uncertainty of the parameter values results in a decrease in the uncertainty of the simulations. Please note, though, that in this case the uncertainty is the uncertainty due to parametric uncertainty only and does not take into account measurement error or model inadequacies.
fr: La réduction de l'incertitude des valeurs des paramètres produit une diminution de l'incertitude des simulations. Veuillez noter, pourtant, que dans ce cas l'incertitude comprends seulement l'incertitude paramétrique et ne prend en compte les erreurs de mesure ou les imperfections du modèle.

source: We note that uncertainty is not equal along the year. Uncertainty is greater for periods of high and, especially, for low temperatures.
fr: On voit que l'incertitude n'est pas égale le long de l'année. L'incertitude est plus grande pour les périodes avec des températures élevées et, spécialement, basses.

source: The following figure shows the percent reduction in uncertainty by parameter and forecast date. It can be seen that forecasts on days with lower temperatures are influenced mostly by :math:`\mu` and forecasts on days with the highest temperatures are influenced mostly by :math:`\alpha`. This is quite logical since :math:`\alpha` determines the higher asymptote of the logistic curve and :math:`\mu` determines the lower asymptote.
fr: La figure suivante montre le pourcentage de réduction de l'incertitude par paramètre et date de la prédiction. On peut voire que les prédictions pour les jours avec de basses température sont influencées principalement par :math:`\mu` et les prédictions pour les jours avec les plus hautes températures sont influencées principalement par :math:`\alpha`. Ceci est assez logique car :math:`\alpha` détermine l'asymptote supérieure de la courbe logistique et :math:`\mu` en détermine l'asymptote inférieure.

source: This figure shows the percentage reduction in uncertainty that we would obtain in the estimation of the value of the parameters by acquiring a measurement on the given days.
fr: Cette figure montre le pourcentage de réduction de l'incertitude de l'estimation des paramètres qu'on obtiendrait par l'acquisition d'une mesure dans les jours donnés.

source: If we wanted to reduce the uncertainty of winter and summer forecasts, which measurements would we need to take? We can investigate this question with the concept of data worth. In the next figure we show data worth as the percent uncertainty increase when removing an observation for two forecasts, for 1 January 2015 and for 1 July 2015. We see the most valuable data to reduce forecast uncertainty is that which corresponds to the same period of the year. We would thus need to concentrate our measurement efforts in the summer and winter.
fr: Si on voulait réduire l'incertitude des prédictions en été et en hiver, quels mesures additionnels devrions-nous prendre ? On peut investiguer cette question avec le concept de valeur des données. La figure suivante montre la valeur des données comme le pourcentage d'incrément de l'incertitude quand on élimine une observation pour deux prévisions, celles du 1 janvier 2015 et du 1 juillet 2015. On voit que les données qui ont plus de valeur pour réduire l'incertitude des prédictions sont celles qui correspondent à la même période de l'année. On devrait donc concentrer ses efforts de mesure en été et hiver.

source: Posterior predictive error (error variance analysis)
fr: Erreur prédictive a posteriori (analyse de la variance de l'erreur)

source: Error variance analysis is an alternative linear uncertainty analysis method that decomposes the variance of predictive error into three components:
fr: L'analyse de la variance de l'erreur est une méthode linéaire alternative pour l'analyse d'incertitudes qui décompose la variance de l'erreur prédictive en trois composantes :

source: Potential forecast error arising from parameter uncertainty.
fr: Erreur potentielle de prédiction due à l'incertitude des paramètres.

source: Potential forecast error arising from model-to-measurement misfit (including measurement noise and structural noise).
fr: Erreur potentielle de prédiction due à l'écart entre modèle et mesures (incluant l'erreur des mesures et l'erreur structurelle).

source: Potential forecast error arising from not calibrating all model parameters.
fr: Erreur potentielle de prédiction due à la calibration seulement d'une partie des paramètres du modèle.

source: Thus, posterior predictive error is expected to be greater than posterior uncertainty.
fr: Ainsi, on attend que l'erreur prédictive a posteriori soit plus grand que l'incertitude a posteriori.

source: However, one of the difficulties in using error variance analysis lies in estimating the number of singular values to use, which may introduce a certain degree of subjectivity. The error variance analysis uses singular value decomposition (SVD) to estimate the effective dimensionality of the system and different criteria have been proposed to choose how many singular values should be used:
fr: Pourtant, une des difficultés à utiliser l'analyse de la variance de l'erreur est celle d'estimer le nombre de valeurs singuliers à utiliser, ce qui peut introduire un certain dégrée de subjectivité. L'analyse de la variance de l'erreur utilise la décomposition en valeurs singulières (DVS) pour estimer la dimensionnalité effective du système et plusieurs critères ont été proposés pour choisir combien de valeurs singulières il faudrait utiliser :

source: Identifying the place with a sharp elbow.
fr: Identifier le point avec un angle marqué.

source: Use as many singular values as necessary to account for at least 90 % (or 99%) of total energy.
fr: Utiliser autant de valeurs singulières comme il faut pour représenter au moins un 90 % (ou 99 %) de l'énergie totale.

source: When residuals have mean zero and are uncorrelated (white noise), Gavish & Donoho (2014) proposed an optimal threshold of :math:`2.858y_{med}`, where :math:`y_{med}` is the median singular value.
fr: Quand les résidus ont une moyenne de zéro et ne sont pas corrélés (bruit blanc), Gavish & Donoho (2014) ont proposé un seuil optimal de :math:`2.858y_{med}`, où :math:`y_{med}` est la valeur singulière médiane.

source: The rational is that the few singular values kept are enough to characterise most of the information, while the discarded singular values represent mostly noise.
fr: Le raisonnement est que le peu de valeurs singulières retenues sont suffisantes pour caractériser la plus grande partie de l'information, alors que les valeurs singulières rejetées représentent majoritairement du bruit.

source: In our study case, we would need 2 singular values according to the 90% energy criterion. But only 1, according to Gavish & Donoho's hard threshold. However, this threshold might not be appropriate, since we expect the residuals to be correlated. Besides, the power of the second singular value is quite near to this threshold. Thus, we will use 2 singular values in this case.
fr: Dans notre cas d'étude, il nous faudrait 2 valeurs singulières d'après le critère du 90 % d'énergie. Mais seulement 1, d'après le seuil strict de Gavish & Donoho. Cependant, ce seuil pourrait ne pas être approprié, car on espère que les résidus soient corrélés. D'ailleurs, la puissance de la deuxième valeur singulière est assez proche de ce seuil. Ainsi, nous utiliserons 2 valeurs singulières dans ce cas.

source: According to these results, predictive error is greater in the summer and in the winter, in coherence with the results for posterior uncertainty.
fr: D'après ces résultats, l'erreur prédictive est plus importante en été et en hiver, en cohérence avec les résultats obtenus pour l'incertitude a posteriori.

source: Error variance analysis also provides an estimation of parameter identifiability. According to parameter identifiability results (again, using 2 singular values), the calibration data allow to determine uniquely the value of :math:`\gamma` (identifiability near to one). However, for the other parameters the information is shared between them, and the calibration data only allows to estimate a combination of these parameters. This means that the solution obtained for the parameters :math:`\alpha`, :math:`\beta` and :math:`\mu` is not unique, but one of several possibilities with a similar error level. Also, parameters are correlated among themselves.
fr: L'analyse de la variance de l'erreur proportionne aussi une estimation de l'identifiabilité des paramètres. D'après les résultats d'identifiabilité des paramètres (à nouveau, en utilisant 2 valeurs singulières), les données de calibration nous permettent de déterminer comme une valeur unique la valeur de :math:`\gamma` (identifiabilité proche à un). Par contre, pour les autres paramètres l'information est partagée entre eux, et les données de calibration nous permettent seulement d'estimer une combinaison de ces paramètres. Ceci signifie que la solution obtenue pour les paramètres :math:`\alpha`, :math:`\beta` et :math:`\mu` n'est pas unique, mais une de plusieurs possibilités avec un niveau de l'erreur similaire. Aussi, les paramètres sont corrélés entre eux.

source: The parameters with highest identifiability in the study case are :math:`\gamma` and :math:`\beta`, which determine the slope and location of the curve around its inflexion point. But the available data does not allow to determine as well the location of the S-curve asymptotes indicated by :math:`\alpha` and :math:`\beta`.
fr: Les paramètres avec une identifiabilité plus élevé dans le cas d'étude sont :math:`\gamma` et :math:`\beta`, qui déterminent la pente et position de la courbe autour de son point d'inflexion. Mais les données disponibles ne permettent de déterminer également bien la position des asymptotes de la courbe en forme de S, indiquée par :math:`\alpha` et :math:`\beta`.

source: Validation may be considered as a test to assess the degree of coherence of simulations with the observed behaviour. The following figure shows temperature measurements taken in 2015, superimposed on simulations and predictive uncertainty for all days in the same year.
fr: On peut considérer la validation comme un test pour évaluer le dégrée de cohérence des simulations avec le comportement observé. La figure suivante montre les mesures de température prises en 2015, surimposées aux simulations et à l'incertitude prédictive pour tous les jours dans la même année.

source: We see that the predictions are quite consistent with observations: most measurements are within the estimated ranges of predictive error. However, the fact that the measurement for 21 Sept. 2015 is outside the predictive error range may indicate a model inadequacy.
fr: On voit que les prédictions sont assez cohérentes avec les observations : la plupart des mesures sont dans les rangs estimés d'erreur prédictive. Pourtant, le fait que la mesure pour le 21 sept. 2015 soit dehors le range d'erreur prédictive peut indiquer une imperfection du modèle.

source: In fact, the variability of estimated water temperature in spring and autumn seems too large. Water temperature varies more slowly than air temperature, and daily water temperature is best correlated to the average of air temperature in the previous days. This is the rational for the modification proposed by Koch & Grünewald (2010) to Eq. :eq:`model_2`.
fr: En fait, la variabilité de la température de l'eau estimée du printemps et automne semble trop large. La température de l'eau varie plus lentement que la température de l'air, et la température de l'eau est mieux corrélée à la température de l'air des jours antérieurs. Ceci est la justification de la modification proposée par Koch & Grünewald (2010) de l'Éq. :eq:`model_2`.

source: Using the results in a management setting: effect of climate change
fr: Utilisation des résultats dans un scénario de gestion : l'effet du changement climatique

source: We can use the results obtained here to analyse a management question: which would be the effect of climate change? To do this we will use the same air temperatures for 2015 but increased by 1.5 ºC to simulate water temperature using eq. :eq:`model_2`.
fr: Nous pouvons utiliser les résultats obtenus ici pour analyser un problème de gestion management : quel serait l'effet du changement climatique ? Pour faire ça, nous utiliserons les mêmes températures de l'air que pour 2015 mais incrémentées de 1.5ºC pour simuler la température de l'eau avec l'éq. :eq:`model_2`.

source: The model predicts an average increase of 1.1 ºC in water temperature with a 1.5 ºC increase in water temperature. During most of the year predictive uncertainty in the :math:`T_{air} + 1.5` ºC scenario is equal or lower to that during the base scenario, with the exception of July when it increases. It is also the month when uncertainty was already highest for the base scenario. This is related to the difficulty in obtaining a precise value for the parameter :math:`\alpha` and the fact that the warming makes summer temperatures leave the range of values for which there is information. This points to a critical issue: the difficulty in predicting water temperature is greatest when there is a higher risk of high temperatures.
fr: Le modèle prédits une augmentation moyenne de la température de l'eau de 1,1ºC avec une augmentation de 1.5ºC de la température de l'air. Durant la plupart de l'année l'incertitude prédictive du scénario :math:`T_{air} + 1.5`ºC est égale ou inférieure à celle du scénario de base, avec l'exception de juillet, quand elle est plus importante. Il est aussi le mois où l'incertitude était plus notable dans le scénario de base. Ceci a relation avec la difficulté à obtenir une valeur précise du paramètre :math:`\alpha` et le fait que le réchauffement fait que les températures d'été sortent du rang de valeurs pour lesquels il y a de l'information. Cette situation remarque un problème critique : la difficulté de prédire la température de l'eau quand il y a les plus grand risque d'avoir des hautes températures.

source: A note on the use of linear an nonlinear uncertainty methods
fr: Une note sur l'utilisation de méthodes d'analyse de l'incertitude linéaires et non-linéaires

source: Some of the previous analyses are based on the use of linear uncertainty methods. The application of such methods to nonlinear models provides approximate results only. However, although these methods do not allow an exact estimation of uncertainty, they provide semi-quantitative information sufficiently robust to analyse the relative contributions of different sources of uncertainty or parameters (Moore & Doherty, 2005).
fr: Quelques uns des analyses précédents sont basés sur l'utilisation de méthodes linéaires d'analyse de l'incertitude. L'application de telles méthodes à de modèles non-linéaires donne seulement des résultats approximés. Cependant, si bien ces méthodes ne permettent pas une estimation exacte de l'incertitude, elles proportionnent de l'information semi-quantitative suffisamment robuste pour analyser les contributions relatives de différentes sources d'incertitude des paramètres (Moore & Doherty, 2005).

source: Nonlinear methods (such as Monte Carlo methods) could also be used to obtain more appropriate quantitative results. However, they require a much higher number of simulations, which may be prohibitive if the model run time is large. Such methods allow analysing the effect of parametric uncertainty as shown above (see `Prior uncertainty`_). Using such methods, the effect of noise (measurement noise of model structural noise) can also be taken into account by appropriately characterising it, for example, as white noise (if noise is uncorrelated) or as a stochastic process. But to determine the characteristics of noise may require a large dataset.
fr: Les méthodes non-linéaires (telles que les méthodes de Monte Carlo) pourrait être utilisées aussi pour avoir des résultats quantitatifs plus appropriés. Pourtant, elles requièrent un majeur nombre de simulations, que peut être prohibitif si le temps d’exécution du modèle est élevé. Ces méthodes permettent d'analyser l'effet de l'incertitude paramétrique comme on a vu dessus (voir `Incertitude a priori`_). Avec ces méthodes, l'effet du bruit (erreur de mesure ou erreur structurelle du modèle) peuvent être pris en considération aussi par le biais d'une caractérisation appropriée, par exemple, comme un bruit blanc (si le bruit n'est pas corrélé) ou comme un procès stochastique. Mais pour déterminer les caractéristiques du bruit il peut être nécessaire d'utiliser un jeu de données très riche.

source: Thus, to choose between a linear or nonlinear method it is necessary to take into account the model run time and computational cost of the method and the available data.
fr: Ainsi, pour choisir entre une méthode linéaire ou non-linéaire il faut prendre en considération le temps de calcul, le coût computationnel de la méthode et les données disponibles.

source: References
fr: Références
