Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/theory.po
Languages: fr

source: Structural or a priori unidentifiability. It is due to the model structure (conceptualisation of the system, equations, objective function, model of the error structure). This type of unidentifiability can be analysed irrespective of the availability of data. When there is structural unidentifiability, there is "a lack of information about one or more model parameters and results in unbounded variation of the parameters even in the absence of noise." Solving structural unidentifiability may involve acquiring data about other model variables or using a different model structure.
fr: Manque d'identifiabilité structurale ou a priori. Il est dû à la structure du modèle (conceptualisation du système, équations, fonction d'objectifs, modèle de la structure de l'erreur). Ce type de manque d'identifiabilité peut être analysé indépendamment de la disponibilité des données. Quand il y a manque d'identifiabilité, il y a "un manque d'information sur un ou plusieurs paramètres du modèle et produit une variation non borné des paramètres même en absence de bruit." La résolution du problème du manque d'identifiabilité structurale peut comporter l'acquisition de données sur d'autres variables du modèle ou l'utilisation d'une différente structure du modèle.

source: Practical or a posteriori unidentifiability: it corresponds to unidentifiability due to other sources than model structure, mainly forcing dataset and model and observation errors.
fr: Manque d'identifiabilité pratique ou a posteriori : il correspond au manque d'identifiabilité dues à autres causes que la structure du modèle, principalement données de forçage et erreurs du modèle et des observations.

source: Unidentifiability due to the forcing dataset. Complex models can include formulations describing different types of behaviours. If one of those behaviours is not represented in the calibration data, there is no information to estimate the value of the parameters specifically related to that behaviour. Solving this issue would require collecting data for different experimental or environmental conditions.
fr: Manque d'identifiabilité dû aux données de forçage. Les modèles complexes peuvent inclure formulations qui décrivent plusieurs types de comportements. Si un de ces comportements n'est pas représenté par les données de calibration, il n'y a pas d'information pour estimer la valeur des paramètres spécifiquement liés à ce comportement. Pour résoudre ce problème il faudrait collecter des données sous différentes conditions expérimentales ou environnementales.

source: Unidentifiability due to model and observation errors. The presence of structural errors and measurement noise/error results in parameter uncertainty that may affect parameter identifiability. To improve the situation it may help analysing the influence of measurement error on parameter estimation.
fr: Manque d'identifiabilité due aux erreurs du modèle et des observations. La présence d'erreurs structurales et bruit/erreur dans les mesures cause une incertitude des paramètres qui peut affecter l'identifiabilité des paramètres. Pour améliorer la situation il peut être utile d'analyser l'influence de l'erreur de mesure sur l'estimation des paramètres.

source: Structural unidentifiability implies practical unidentifiability. But structural identifiability does not imply practical identifiability.
fr: Le manque d'identifiabilité structurale implique un manque d'identifiabilité pratique. Mais l'identifiabilité structurale n'implique pas l'identifiabilité pratique.

source: Methods to analyse identifiability
fr: Méthodes pour analyser l'identifiabilité

source: Structural identifiability can be assessed by analysing the model's equations. For example, in the following equations the parameter values are unidentifiable:
fr: L'identifiabilité structurale peut être évaluée par l'analyse des équations du modèle. Par exemple, dans les équations suivantes les valeurs des paramètres ne sont pas identifiables :

source: Infinite combinations of values for :math:`\alpha` and :math:`\beta` give the same result.
fr: Infinies combinaisons de valeurs pour :math:`\alpha` et :math:`\beta` donnent le même résultat.

source: Identifiability can also be assessed using sensitivity analysis tools. If a the response of a model is insensitive to a parameter, the parameter is unidentifiable. However, a model may be sensitive to a given parameter and it may still not be possible to identify the parameter value.
fr: L'identifiabilité peut être évaluée aussi avec des outils d'analyse de sensitivité. Si la réponse d'un modèle n'est pas sensible à un paramètre, le paramètre n'est pas identifiable. Cependant, un modèle peut être sensible à un certain paramètre et il peut être comme même impossible d'identifier la valeur du paramètre.

source: Identifiability can also be analysed by visualizing the model's response surface with real or synthetic data. The existence of flat surfaces indicates unidentifiability, while different peaks with equal objective function values are indicative of local identifiability. For simple models, it is possible to visualize the response surface using 2D or 3D plots. For more complex models, it is possible to use dotty plots, which show the variation of the response variable for one or two parameters while varying all other parameters.
fr: L'identifiabilité peut être analysée aussi par la visualisation de la surface de réponse du modèle avec des données réelles ou synthétiques. L'existence de surfaces plates indique manque d'identifiabilité, alors que différents pics avec valeurs pareilles de la fonction d'objectifs indiquent identifiabilité locale. Pour de modèles simples, il est possible de visualiser la surface de réponse avec de graphiques en 2D ou 3D. Pour des modèles plus complexes, il est possible d'utiliser de graphiques de points, qui montrent la variation de la variable de réponse pour un ou deux paramètres à la fois que varient tous les autres paramètres.

source: Finally, some indices have also been proposed to evaluate identifiability. It is the case of identifiability measure proposed by Doherty & Hunt (2009) based on the error variance analysis.
fr: Finalement, quelques indices ont été proposés pour évaluer l'identifiabilité. C'est le cas de la mesure d'identifiabilité proposé par Doherty & Hunt (2009) basée sur l'analyse de la variance de l'erreur.

source: Calibration, parameter estimation and history matching are three synonyms for the process of finding the optimal value of a model's parameters. Optimality is here defined as the minimisation of an objective function, representing some kind of distance between simulated and observed values. Usually the modeller aims to obtain a global optimum, and then assesses parameter and predictive uncertainty with respect to this optimum. The objective is that parameter and predictive uncertainty should be reduced after the calibration process.
fr: Calibration, estimation de paramètres et couplage d'historique sont trois synonymes pour le procès d'identification de la valeur optimale des paramètres d'un modèle. L'optimalité est définie ici comme la minimisation d'une fonction d'objectifs, qui représente quelque sorte de distance entre valeurs simulées et observées. D'habitude le modélisateur essaye d'obtenir un optimum global, et après analyse l'incertitude des paramètres et prédictive par rapport à cet optimum. L'objectif est de réussir à réduire l'incertitude prédictive et des paramètres après le procès de calibration.

source: **Global optimum:** best solution across the entire parameter space.
fr: **Optimum global :** meilleure solution au large de l'entier espace des paramètres.

source: **Local optimum:** best solution in its immediate neighbourhood in the parameter space.
fr: **Optimum local :** meilleure solution dans le voisinage immédiat dans l'espace des paramètres.

source: When the conditions are optimal, i.e., there is a clear global optimum and there are no local optima, an automatic search algorithm may be used.
fr: Quand les conditions sont optimales, c'est-à-dire, il y a un optimum global clair et il n'y a pas d'optimums locaux, un algorithme automatique de descente de pente peut être utilisé.

source: However, the identification of an optimum may be hampered by the use of threshold parameters, by correlation between parameters, by autocorrelation and heteroscedasticity in the residuals and by insensitive parameters. These effects may cause local minima, valleys and plateaus in the parameter response surface. In such cases, global calibration methods (such as Differential Evolution) may be more appropriate. But there cases when even these methods may have problems in identifying a simple set of parameter values. Instead of an optimum there are several optima with similar performance. This is known as equifinality (Beven & Freer, 2001).
fr: Cependant, l'identification d'un optimum peut être empêchée par l'utilisation de paramètres de seuil, par la corrélation entre paramètres, par l'autocorrélation et heteroscedasticité dans les résidus et par les paramètres auquel le modèle n'est pas sensible. Ces effets peuvent causer des minimums locaux, des vallées et plateaux dans la surface de réponse des paramètres. Dans de tels cas, les méthodes globales de calibration (telle que l'Évolution Différentielle) peuvent être préférables. Mais il y a des cas où même ces méthodes peuvent avoir des problèmes à identifier un ensemble de valeurs des paramètres unique. Au lieu d'un optimum il y a plusieurs optimums avec performance pareille. Ceci est connu comme equifinalité (Beven & Freer, 2001).

source: Some more sophisticated techniques try to address the equifinality problem. For example, Monte Carlo methods such as GLUE (Generalized Likelihood Uncertainty Estimation) (Beven & Binley, 1992). The GLUE method is not implemented in this package, but it can be applied easily by properly treating the output of the :func:`monte_carlo` function.
fr: Quelques techniques plus sophistiquées essayent d'affronter le problème de l'equifinalité. Par exemple, les méthodes de Monte Carlo comme GLUE (Generalized Likelihood Uncertainty Estimation) (Beven & Binley, 1992). La méthode GLUE n'est pas implémentée dans ce paquet, mais peut être appliquée facilement par un traitement approprié du retour de la fonction :func:`monte_carlo`.

source: Also, the Iterative Ensemble Smoother, rather than finding an optimum set of parameter values, obtains several optimum sets of parameter values. The method draws several random samples of the prior parameter distributions and adjusts their values iteratively, so that each set of parameter values can be considered to be calibrated. The ensemble of optimized sets can be considered as a sampling of the posterior distribution.
fr: Aussi, le Lissage Itératif d'Ensemble, plutôt que chercher un seul ensemble de valeurs des paramètres optimales, en obtient plusieurs. La méthode extrait plusieurs échantillons aléatoires depuis les distributions des paramètres a priori et ajuste leurs valeurs itérativement, de façon que chaque ensemble de valeurs des paramètres peut être considéré comme calibré. L'ensemble des ensembles optimisés peut être considéré comme un échantillon de la distribution a posteriori.

source: Validation or, more appropriately, conditional validation consists in the evaluation of model performance to conditions that differ from calibration ones. The objective is to test whether the model performs equally well under a different set of circumstances.
fr: La validation ou, plus adroitement, validation conditionnelle consiste en l'évaluation de la performance du modèle sous des conditions différentes de celles de la calibration. L'objectif est de tester si le comportement du modèle est aussi bon sous un groupe différent de circonstances.

source: If the simulated behaviour of the system is consistent with the observed behaviour, we cannot assume the model has been absolutely validated; it has only been validated for the sets of circumstances included in the calibration and validation data sets.
fr: Si le comportement simulé du système est cohérent avec le comportement observé, on ne peut pas présumer que le modèle a été absolument validé ; il a été validé seulement pour la série de circonstances inclues dans les jeux de données de calibration et validation.

source: If the model results are incoherent with the observations, it would be necessary to review the data, model structure and parameter values to identify the source of the mismatch. In a sense, rather than confirming the model validity, the objective of validation may be seen as an attempt to falsify the model, to find areas where it needs improvement.
fr: Si les résultats du modèle sont incohérents avec les observations, il faudrait réviser les données, la structure du modèle et les valeurs des paramètres pour identifier la source du désaccord. Dans un certain sens, plutôt que confirmer la validité du modèle, l'objectif de la validation peut être considéré comme un essai de falsifier le modèle, pour trouver des aires où il a besoin d'amélioration.

source: Sensitivity analysis
fr: Analyse de sensitivité

source: Should we vary slightly our modelling assumptions and the input data, the predicted behaviour would also vary. How much would the simulated behaviour vary if we varied model structure, parameter values and input data within reasonable ranges? Answering this question is the aim of the sensitivity analysis.
fr: Si on varie légèrement les présuppositions du modèle et des données d'entrée, le comportement prédit variera aussi. En quel dégrée varie le comportement simulé si on varie la structure du modèle, les valeurs des paramètres et les données d'entrée dans des rangs raisonnables ? Répondre à cette question est l'objectif de l'analyse de sensitivité.

source: In other words, sensitivity analysis is the analysis of how the model's output varies with variations in the parameter values. This definition can be translated into practice in different ways:
fr: Dit autrement, l'analyse de sensitivité est l'analyse de comment varie le retour du modèle en fonction des variations des valeurs des paramètres. Cette définition peut être transposée dans la pratique de plusieurs façons :

source: Defining sensitivity as the partial derivative of the output :math:`Y` with respect to a parameter :math:`X_i`: :math:`S_i={\delta Y}/{\delta X_i}`. This is the usage in local sensitivity analyses (sensitivity is evaluated at a given point), and sensitivity indices are often estimated by varying one parameter at a time. However, in nonlinear models sensitivity varies within the parameter space.
fr: En définissant la sensitivité comme la dérivée partielle de la sortie :math:`Y` par rapport au paramètre :math:`X_i` : :math:`S_i={\delta Y}/{\delta X_i}`. Ceci est l'usage qu'on trouve dans les analyses de sensitivité locaux (la sensitivité est évaluée sur un point donné), et les indices de sensitivité sont souvent estimés en faisant varier un paramètre à chaque fois. Cependant, dans les modèles non linéaires la sensitivité varie quand on se déplace dans l'espace des paramètres.

source: Linear regression coefficients can be considered as sensitivity indices in linear models. In particular, standardized regression coefficients (SRC) indicate the contribution of the variance of each input factor to the model output variance. The data for the linear regression can be obtained from Monte Carlo runs. Since SRCs are calculated over a range of values they may be considered as global sensitivity indices. In addition, linear regression models may be used to assess the degree of linearity of a model. If the coefficient of determination of the model is high (for example, :math:`R^2 \geq 0.7`), the model may be considered to be linear and the SRCs may be used for sensitivity analysis (Hall et al. 2009).
fr: Les coefficients de régression linéaire peuvent être considérés comme des indices de sensitivité pour les modèles linéaires. En particulier, les coefficients de régression standardisés (SRC) indiquent la contribution de la variance de chaque facteur d'entrée sur la variance du retour du modèle. Les données pour la régression linéaire peut être obtenue à partir de simulations de Monte Carlo. Du moment où les SRCs sont calculés sur un rang de valeurs ils peuvent être considérés comme des indices de sensitivité globaux. De plus, les modèles de régression linéaire peuvent être utilisés pour évaluer le dégrée de linéarité d'un modèle. Si le coefficient de détermination du modèle est élevé (par exemple, :math:`R^2 \geq 0.7`), le modèle peut être considéré linéaire et les SRCs peuvent être utilisés pour l'analyse de sensitivité (Hall et al. 2009).

source: If the system is nonlinear (:math:`R^2 < 0.7`), more sophisticated (global) methods will be necessary. Good introductions to global sensitivity analysis are given by Saltelli et al. (2004) and Saltelli et al. (2008). We mention here a few options:
fr: Si le système est non linéaire (:math:`R^2 < 0.7`), des méthodes (globales) plus sophistiquées seront nécessaires. Good introductions to global sensitivity analysis are given by Saltelli et al. (2004) and Saltelli et al. (2008). On donne ci-dessous quelques options :

source: Morris's method. It is a one-at-a-time method that analyses sensitivity at different points along the range of parameter values to obtain an average sensitivity measure. It has a low computational cost and is thus specially apt for models with a high computational time or there is a large number of uncertain parameters. Morris's method is implemented in this package.
fr: Méthode de Morris. Il s'agit d'une méthode de "variation une à la fois" qu'analyse la sensitivité à différents points le long du rang de valeurs des paramètres pour obtenir un mesure de sensitivité moyenne. Elle a un bas coût computationnel et est donc spécialement adaptée aux modèles avec des longs temps de calcul ou quand il y a un grand nombre de paramètres incertaines. La méthode de Morris est implémentée dans ce paquet.

source: Variance decomposition methods. The variance of the model output is decomposed into different components, each one attributable to one parameter (or combination of parameters). We have implemented Sobol's method in this package. It has a higher computational cost than Morris's method.
fr: Méthodes de décomposition de la variance. La variance du retour du modèle est décomposé en différentes composantes, chaque une attribuable à un paramètre (ou combinaison de paramètres). On a implémenté la méthode de Sobol dans ce paquet. Elle a un coût computationnel plus élevé que la méthode de Morris.

source: Monte Carlo filtering (also, Hornberger-Spear-Young method or Regional Sensitivity Analysis). A performance threshold is used to separate between "acceptable" and "unacceptable" simulations (and parameter sets). If there are differences between the distribution of parameter values for acceptable and unacceptable simulations, the model is sensitive to that parameter. They have a very high computational cost (of the order of thousands of Monte Carlo runs).
fr: Le filtrage de Monte Carlo (ou aussi méthode de Hornberger-Spear-Young ou Analyse de Sensitivité Régionalisée). On utilise un seuil de performance pour séparer entre des simulations "acceptables" et "inacceptables" (et ensembles de paramètres). S'il y a des différences entre la distribution des valeurs d'un paramètre pour les simulations acceptables et inacceptables, le modèle est sensible à ce paramètre. Ils ont un coût computationnel très élevé (de l'ordre de milliers d'exécutions de Monte Carlo).

source: The results of the sensitivity analysis depend on the range of parameter values explored in the analysis, i.e., on the uncertainty of individual parameters.
fr: Les résultats de l'analyse de sensitivité dépend du rang de valeurs des paramètres exploré pendant l'analyse, c'est-à-dire, de l'incertitude des paramètres individuels.

source: Sensitivity analysis may be used to answer the following questions (Hall et al. 2009):
fr: L'analyse de sensitivité peut être utilisé pour répondre aux questions suivantes (Hall et al. : 2009):

source: Which are the factors that influence most the model output?
fr: Quels sont les facteurs qu'influence le plus le retour du modèle ?

source: Are there any factors we need to investigate more in depth to be more confident on the model output?
fr: Il y a des facteurs qu'il faudrait investiguer plus en détail pour augmenter la crédibilité du retour du modèle ?

source: Are there any factors which have an insignificant influence on model output, so that they can be discarded from subsequent analyses?
fr: Il y a des facteurs qui ont une influence méprisable sur le retour du modèle, de façon qu'ils puissent être écartés dans les analyses subséquentes ?

source: Does the model reproduce known relations?
fr: Le modèle reproduit de relations connues ?

source: Are there regions in the input space where the variation in the model output is maximum?
fr: Il y a des régions dans l'espace des entrées pour lesquelles la variation du retour du modèle est maximale ?

source: Which are the optimal regions in parameter space for calibration?
fr: Quelles sont les régions optimales dans l'espace des paramètres pour la calibration ?

source: Are there any factors or group of factors that interact between themselves?
fr: Il y a des facteurs ou groupes de facteurs qu'interagissent entre eux ?

source: Is model output robust to reasonable discrepancies in the value of input factors? Or is the model highly sensitive to small variations of the value of a parameter (which might indicate overfitting)?
fr: Est-ce que le retour du modèle est robuste face à différences raisonnables de la valeur des facteurs d'entrée ? Ou est-ce que le modèle est très sensible à des petites variations de la valeurs d'un paramètre (ce qui pourrait être indicatif de surcalibration) ?

source: Sensitivity analysis and uncertainty analysis
fr: Analyse de sensitivité et analyse d'incertitudes

source: Uncertainty analysis and sensitivity analysis are related concepts:
fr: L'analyse de sensitivité et l'analyse d'incertitudes sont des concepts relationnés.

source: Uncertainty analysis consists in the quantification of the uncertainties in model inputs and propagating them to obtain the uncertainty of model forecasts.
fr: L'analyse d'incertitudes consiste en la quantification des incertitudes des entrées du modèle et en leur propagation pour obtenir l'incertitude des prédictions du modèle.

source: Sensitivity analysis, instead, consists in assessing how variations in the model inputs, individually or in combination, influence the variation in the model outputs.
fr: L'analyse de sensitivité, par contre, consiste en l'évaluation de comment les variations des entrées su modèle, individuellement ou en combinaison, influencent la variation des sorties du modèle.

source: Thus, the focus of uncertainty analysis is on determining the limits of our knowledge (and lack of knowledge) about the system and its response. While sensitivity analysis is more centred on determining the factors that affect most the model output.
fr: Ainsi, le point central d'intérêt de l'analyse d'incertitudes est la détermination des limites de nos connaissances (et de notre manque de connaissance) sur le système et ses réponses. Alors que l'analyse de sensitivité est plus centré sur la détermination des facteurs qu'affectent les plus le retour du modèle.

source: Uncertainty analysis
fr: Analyse d'incertitudes
