Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/theory.po
Languages: fr

source: A bit of theory
fr: Un peu de théorie

source: In order to help the user understand better the utilisation and functionalities of this package, we make a short introduction to calibration and uncertainty analysis.
fr: De façon à aider l'utilisateur à mieux comprendre l'utilisation et fonctionnalités de ce paquet, nous faisons une petite introduction à la calibration et l'analyse d'incertitudes.

source: Models and simulations
fr: Simulations et modèles

source: Definitions
fr: Définitions

source: Models can be considered as approximations of reality based on mathematical relations and inferences based on data. A model receives forcing data (input data) and transforms it into output data (simulation) by applying a series of mathematical procedures. The output of a model can be of several types, defined in the following table:
fr: On peut considérer les modèles comme des approximations de la réalité basées sur des relations mathématiques et sur des inférences dérivées des données. Un modèle reçoit des données de forçage (données d'entrée) et les transforme en données de sortie (simulation) par l'application d'une série de procédures mathématiques. Le retour d'un modèle peut être de plusieurs types, définis dans la table suivante :

source: Definitions of types of model output [#]_
fr: Définitions des types de retour d'un modèle [#]_

source: **Term**
fr: **Terme**

source: **Definition**
fr: **Définition**

source: Quantitative reproduction of the behaviour of a system, given some defined inputs but without reference to any observed outputs.
fr: Reproduction quantitative du comportement d'un système, données quelques entrées mais sans faire référence à aucun retour observé.

source: Forecast
fr: Prédiction

source: Quantitative reproduction of the behaviour of a system ahead of time, but given observations of the inputs, state variables, and outputs up to the forecast origin.
fr: Reproduction quantitative du comportement d'un système à l'avance, mais avec des observations des entrées, variables d'état, et sorties jusqu'au départ de la prédiction.

source: Hindcast
fr: Simulation rétrospective

source: Application of forecasting to past data as if the inputs and outputs were only available up to a certain point in time.
fr: Application de la technique de prédiction à données dans le passé comme si les entrées et sorties n'était disponibles que jusqu'à un certain point dans le temps.

source: Simulation of the future behaviour of a system given prior assumptions about future input data.
fr: Simulation du comportement future d'un système depuis des suppositions a priori sur les données d'entrée futures.

source: Based on Beven & Young (2013).
fr: Basé sur Beven & Young (2013).

source: As approximations of reality, models are often used to inform management decisions and to understand better the behaviour of the systems they try to reproduce. By comparing the simulation results to observations it is possible to detect circumstances when the model does not perform well. By analysing these cases, and collecting complementary data, the models may also be used to improve our knowledge of the modelled system.
fr: En fonction d'approximations de la réalité, les modèles sont souvent utiliser pour donner support à des décisions de gestion et pour comprendre mieux le comportement des systèmes qu'ils essayent de reproduire. À travers la comparaison des résultats de simulation aux observations il est possible d'identifier des cas où le comportement du modèle est pire. Par l'analyse de ces cas, et la récollection de données complémentaires, les modèles peuvent être utilisés aussi pour améliorer notre compréhension du système modélisé.

source: Models are useful tools to analyse the behaviour of a system and to increase our understanding of it.
fr: Les modèles sont des instruments utiles pour analyser le comportement d'un système et pour en incrémenter notre compréhension.

source: The modelling process
fr: Le procès de modélisation

source: The modelling process can be divided in 10 stages (Jakeman et al., 2006):
fr: Le procès de modélisation peut être sous-divisé en 10 étapes (Jakeman et al., 2006) :

source: Definition of the model purpose
fr: Définition du but du modèle

source: Specification of the modelling context: scope and resources
fr: Spécification du contexte de modélisation : portée et ressources

source: Conceptualisation of the system, specification of data and prior knowledge
fr: Conceptualisation du système, spécification de données et des connaissances a priori

source: Selection of model features
fr: Sélection des caractéristiques du modèle

source: Determination of the method to identify model structure and parameter values
fr: Détermination de la méthode pour identifier la structure du modèle et les valeurs des paramètres

source: Selection of the performance criteria and algorithm
fr: Sélection des critères de performance et algorithmes

source: Identification of the model structure and parameter values
fr: Identification de la structure du modèle et des valeurs des paramètres

source: Conditional verification, including diagnostic testing
fr: Vérification conditionnelle, inclus les tests de diagnose

source: Quantification of uncertainty
fr: Quantification de l'incertitude

source: Model evaluation
fr: Évaluation du modèle

source: Of these stages, we are interested here in the last ones. However, some of the techniques presented in this document may inform other stages of the process too. Also, the calibrated model may be useful to inform initial stages of the modelling process (e.g., which additional measurements to take) in successive iterations.
fr: De ces étapes, nous sommes intéressés ici aux dernières. Cependant, quelques-unes des techniques présentées dans ce document peuvent apporter information utile pour d'autres étapes du procès aussi. De plus, le modèle calibré peut être d'utilité pour donner support aux étapes initiales du procès de modélisation (p. ex., quelles mesures additionnelles il faudrait prendre) en itérations postérieures.

source: At the end of the process, we hope to obtain a model that has the following characteristics (Beck 1987):
fr: À la fin du procès, on espère d'atteindre un modèle qui ait les caractéristiques suivantes (Beck 1987) :

source: The parameters of the model should not vary with time. Parameter values that vary with time may be indicative of an inadequate model structure or of processes not taken into account.
fr: Les paramètres du modèle ne devraient varier pas dans le temps. Les valeurs des paramètres qui varient dans le temps peuvent indiquer une structure du modèle imparfaite ou l'existence de procès non pris en considération.

source: The variance of residuals and the covariance of parameters are low, indicating that the model parameters have been well identified.
fr: La variance des résidus et la covariance des paramètres sont petites, ce qui indique que les paramètres du modèle ont été bien identifiés.

source: The residuals are small and are not attributable to any nonrandom causal mechanism.
fr: Les résidus sont petits et ne sont pas attribuables à aucun mécanisme causal non aléatoire.

source: Evaluation of model performance
fr: Évaluation de la performance du modèle

source: If models are to be used as management tools, to provide evidence on which to base decisions, it is only natural to assess their ability to simulate the behaviour of the system. The comparison of simulations to observations or expectations is known as model evaluation and can take several forms.
fr: Si les modèles doivent être utilisés comme des outils de gestion, pour apporter de l'information sur laquelle baser des décisions, il est complètement naturel d'évaluer leur capacité de simuler le comportement du système. La comparaison des simulations aux observations ou résultats espérés est connue comme évaluation du modèle et peut prendre plusieurs formes.

source: Definitions on model evaluation [#]_
fr: Définitions sur l'évaluation de modèles [#]_

source: Verification
fr: Vérification

source: Only for checks that a model computer code properly reproduces the equations it purports to solve. Will generally be only conditional verification dependent on the range of tests carried out.
fr: Seulement pour tester si le code informatique du modèle reproduis de façon correcte les équations qu'il est censé de résoudre. Il s'agit généralement seulement d'une vérification conditionnelle qui dépends de la portée des tests réalisés.

source: Conditional evaluation that a model computer code reproduces some observed behaviour of the system being studied to an acceptable degree.
fr: Évaluation conditionnelle que le code informatique d'un modèle reproduis quelque comportement observé du système étudié avec une qualité acceptable.

source: An assessment that a model computer code does not reproduce some observed behaviour of the system to an acceptable degree.
fr: L'appréciation que le code informatique d'un modèle ne reproduis pas quelque comportement observé du système étudié avec une qualité acceptable.

source: Fit-for-purpose
fr: Apte à l'utilisation prévue

source: Conditional evaluation that a computer model code is suitable for use in a particular type of application.
fr: Évaluation conditionnelle que le code informatique d'un modèle est approprié pour son utilisation dans un certain type particulier d'application.

source: Modified from Beven & Young (2013, Table 3).
fr: Modifié depuis Beven & Young (2013, Table 3).

source: Reassessment of the model's aim, scale and scope. Make sure you have a clear idea of the model's objective: which are the main variables of interest and for what they will be used. This includes stating the desired quality of the simulations, i.e., what constitutes good performance in your particular modelling setup.
fr: Réanalyse de l'objet, échelle et portée du modèle. Il faut s'assurer d'avoir une idée claire de l'objectif du modèle : quelles sont les variables d'intérêt principales et comment elles seront utilisées. Ça inclue décider quelle est la qualité désirée des simulations, soit, qu'est-ce qui constitue une bonne performance dans le type particulier de scénario de modélisation.

source: Characterisation of the data for calibrating and testing. Check the quality of the data (presence of outliers, inhomogeneities, etc.) and its extension (is it sufficient?). Select data subsets for calibration and validation.
fr: Caractérisation des données à utiliser pour la calibration et la réalisation de tests. Il faut vérifier la qualité des données (présence de valeurs aberrantes, inhomogénéités, etc.) et leur extension (est-ce qu'elles sont suffisantes ?). Sélection de sous-ensembles de données pour la calibration et pour la validation.

source: Visual and other analysis to detect bad model behaviour and to characterise overall performance. Use plots, graphs, animations and other visual methods to gain an overview of overall performance.
fr: Analyses visuelles et d'autre type pour identifier des mauvais comportements du modèle et pour caractériser la performance globale. Il faut utiliser figures, graphiques, animations et d'autres méthodes visuelles pour acquérir une vision d'ensemble de la performance du modèle.

source: Selection of basic performance criteria. Select metrics, such as RMSE and :math:`r^2`, to measure model performance. Bennett et al. (2013) provide several methods for measuring quantitative model performance. The selected method needs to take into account the modelling objective and available data. For a comprehensive evaluation of models it is advisable to use systems of metrics (or multiple-objective functions) that measure different aspects of model performance.
fr: Sélection de critères basiques de performance. Il faut choisir des métriques, telles que le RMSE et :math:`r^2`, pour mesurer la performance du modèle. Bennett et al. (2013) provide several methods for measuring quantitative model performance. La méthode choisie doit prendre en considération l'objectif de la modélisation et les données disponibles. Pour une évaluation compréhensive des modèles il est conseillé d'utiliser systèmes de métriques (ou fonctions à objectif multiple) qui mesurent différents aspects de la performance du modèle.

source: Use of more advanced methods to solve modelling problems. Analyse the evaluation of model performance and assess whether any refinement is necessary in the process, going back to previous stages if necessary.
fr: Utilisation de méthodes plus puisées pour résoudre problèmes de modélisation. Il faut analyser l'évaluation de la performance du modèle et voire s'il est nécessaire de faire quelque amélioration dans le procès, retournant aux étapes antérieures s'il le faut.

source: If the model does not perform well, this may indicate:
fr: Une mauvaise performance du modèle peut indiquer :

source: the available data is insufficient to calibrate the model properly, and more data should be obtained;
fr: les données disponibles sont insuffisantes pour calibrer le modèle de façon appropriée, et il faudrait obtenir plus de données ;

source: there are problems with the input data (there might be unaccounted biases or other issues);
fr: il y a des problèmes avec les données d'entrée (il pourrait y avoir des biais non détectés ou d'autres problèmes) ;

source: it could be advisable to use another calibration method (a local maximum might have been attained, instead of the global maximum);
fr: l'utilisation d'une autre méthode de calibration pourrait être préférable (la méthode pourrait avoir atteint un maximum local, au lieu d'un maximum global) ;

source: the model structure needs to be improved.
fr: la structure du modèle doit être améliorée.

source: A note of caution
fr: Une note d'avertissement

source: While models are invaluable tools for scientific research and management, they are not perfect and it is necessary for the modeller to be aware of their limitations. The absolute validation and verification of numerical models is impossible for epistemic reasons (Oreskes et al. 1994). A model cannot reproduce exactly the behaviour of a natural system because of our limited knowledge of the system. In fact, a model is an incomplete representation of reality that uses approximations and assumptions. In addition, measurements capture the state of the system in a limited way: they are subject to measurement error and there may be limitations in spatial or temporal resolution.
fr: Bien que les modèles soit des outils inestimable pour la recherche scientifique et la gestion, ils ne sont libres de défauts et il faut que le modélisateur soit conscient de leur limitations. La validation et vérification absolues des modèles numériques est impossible pour des raisons épistémiques (Oreskes et al. 1994). Un modèle ne peut pas reproduire exactement le comportement d'un système naturel à cause de nos connaissances limitées du système. En fait, un modèle est une représentation incomplète de la réalité qui utilise des approximations et des suppositions. De plus, les mesures capturent l'état du système de façon limitée : elles sont susceptibles d'erreurs de mesure et il peut y avoir de limitations à la résolution spatiale ou temporelle.

source: Thus, validation and verification are only conditional (Boschetti et al. 2011). They are conditional to the ranges of parameter values and input data used: model or data deficiencies not yet detected might be discovered in the future, when the model has been tested in other situations or with more data.
fr: Ainsi, la validation et vérification sont seulement conditionnelles (Boschetti et al. 2011). Elles sont conditionnelles aux rangs des valeurs des paramètres et des données d'entrée utilisés : imperfections du modèle ou des données pourrait être détectées dans un temps futur, quand le modèle a été testé en d'autres situations ou avec plus de données.

source: The model output also depends on the implicit and explicit assumptions made in its specification and how the behaviour of the system has been implemented. In fact, the model will not be able to reproduce a behaviour that has not been specified in its code. Also, the calibration data informs the values of the parameters. This means that the model will perform best when the behaviour of the system is similar to the behaviour reflected in the calibration data.
fr: Le retour du modèle dépends aussi des suppositions implicites ou explicites faites dans sa spécification et de comment on a implémenté le comportement du système. En fait, le modèle ne sera pas capable de reproduire un comportement que n'a pas été spécifié dans son code. Aussi, les données de calibration conditionnent les valeurs des paramètres. En conséquence, le modèle aura une meilleur performance quand le comportement du système est similaire au comportement imbu dans les données de calibration.

source: A simulation is only as good as data and model specification allow it to be.
fr: Une simulation ne peut pas être meilleur que ce que lui permettent les données et la spécification du modèle.

source: In order to guard against model and data imperfections it is best practice to estimate and communicate uncertainty.
fr: De façon à se protéger des imperfections du modèle et des données il est une pratique exemplaire d'estimer et communiquer l'incertitude.

source: Identifiability
fr: Identifiabilité

source: An important concept in the modelling process is that of identifiability. Parameter identifiability analysis assesses whether it is possible to determine a unique vector of parameter values that optimises model performance or there are multiple parameter values that result in a similar model performance. The result of a lack of identifiability is the absence of a unique optimum combination of parameter values (the model performs with similar good performance for different combinations of parameter values) and in high error variances and covariances of parameters. Good introductions to the concept of identifiability are given by Beck (1987) and Guillaume et al. (2019).
fr: Un concept important dans le procès de modélisation est celui d'identifiabilité. L'analyse de l'identifiabilité des paramètres étudie si c'est possible de déterminer un vecteur de valeurs des paramètres unique qui optimise la performance du modèle ou s'il y a multiples valeurs des paramètres qui donnent une performance du modèle comparable. Le résultat d'un manque d'identifiabilité est l'absence d'une combinaison optimale des valeurs des paramètres unique (le modèle donne des simulations similairement bonnes avec différentes combinaisons des valeurs des paramètres) et l'existence de grandes variances de l'erreur et de la covariance des paramètres. Bonnes introductions au concept d'identifiabilité sont données par Beck (1987) et Guillaume et al. (2019).

source: "Parameter identifiability analysis assesses whether it is theoretically possible to estimate unique parameter values from data, given the quantities measured, conditions present in the forcing data, model structure (and objective function), and properties of errors in the model and observations. In other words, it tackles the problem of whether the right *type* of data is available to estimate the desired parameter values." Guillaume et al. (2019, p. 418)
fr: "L'analyse d'identifiabilité des paramètres étudie si c'est théoriquement possible d'estimer valeurs des paramètres uniques depuis les données, d'après les quantités mesurées, les conditions présentes dans les données de forçage, la structure du modèle (et fonction objectif), et les caractéristiques des erreurs dans le modèle et les observations. Dit autrement, elle s'occupe du problème de si des données du *type* correcte sont disponibles pour estimer les valeurs des paramètres souhaitées." Guillaume et al. (2019, p. 418)

source: Thus, the analysis of identifiability is related to the design of experiments and monitoring programs, so that the collected data ensures optimal identifiability. If the model structure is suitable to the modelled system, obtaining more data should result in a reduced parameter uncertainty. However, this only happens if the measure is of the right type. This is also related to the concept of data worth.
fr: Ainsi, l'analyse d'identifiabilité a relation avec le plan expérimental et les programmes de surveillance, de façon que le mesures enregistrées assurent une identifiabilité optimale. Si la structure du modèle est appropriée au système modélisé, l'acquisition de plus de données devrait contribuer à réduire l'incertitude des paramètres. Cependant, ça ne s'avère que si la mesure est du type correcte. Ceci est lié aussi au concept de valeur des données.

source: In a linear system of equations, parameter values are identifiable when the number of unknowns is less than the number of observations. When the number of unknowns is greater than the number of observations, the system is underdetermined and the problem is ill-posed (and infinite solutions are possible).
fr: Dans un système linéaire d'équations, les valeurs des paramètres sont identifiables quand le nombre d'inconnues est moins que le nombre d'observations. Quand le nombre d'inconnues est majeur que le nombre d'observations, le système est sous-déterminé et le problème n'est pas bien posé (est il y a infinies possibles solutions).

source: In a complex nonlinear environmental models, instead, the previous rule is not applicable and more sophisticated methods are necessary. In this type of models we often find a lack of identifiability, since the complexity of the model is usually greater than the available information about the behaviour of the system. But having as much (or more) observations as parameters does not ensure they are identifiable. For example, a model may include descriptions of behaviours not present in the calibration data set, and thus their parameter values cannot be informed by observations. In other cases, it may not be possible to distinguish between several overlapping processes from the available data. Also, the model may even simulate state variables for which there are no available observations.
fr: En modèles environnementaux complexes non linéaires, par contre, la règle précédente n'est pas applicable et il faut utiliser des méthodes plus sophistiquées. En ce type de modèles on trouve souvent un manque d'identifiabilité, puisque la complexité du modèle est d'habitude plus importante que l'information disponible sur le comportement du système. Mais le fait d'avoir autant (ou plus) d'observations que paramètres n'assure pas qu'ils soient identifiables. Par exemple, un modèle peut inclure des descriptions de comportements qui ne sont pas représentés dans les données de calibration, et en conséquence les observations n'apportent pas information pour déterminer les valeurs de leurs paramètres. Dans d'autres cas, il peut être difficile de distinguer plusieurs procès qui se superposent depuis les données disponibles. De plus, le modèle peut même simuler variables d'état pour lesquels il n0y a pas des observations disponibles.

source: Sources of unidentifiability
fr: Sources de la manque d'identifiabilité

source: We can find several types of unidentifiability:
fr: On peut trouver plusieurs types de manque d'identifiabilité :
