Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/theory.po
Languages: fr

source: Environmental models cannot predict the future. What they provide are possible realistic behaviours that approach the behaviour of the real system. The uncertainty analysis deals with the confidence we can place on such forecasts and which are the ranges within which a predicted quantity may vary.
fr: Les modèles environnementaux ne peuvent pas prédire le futur. Ce qu'ils fournissent sont des possibles comportements réalistes qui s'approximent au comportement du système réel. L'analyse d'incertitudes s'occupe de la crédibilité qu'on peut attribuer à ces prévisions et des rangs dans lesquels une quantité prédite peut varier.

source: The uncertainty of model simulations has mainly three sources:
fr: L'incertitude des simulations d'un modèle a trois causes principales :

source: Structural uncertainty, due to the uncertainty in the structure of the model. Since our knowledge of the system behaviour is incomplete, our implementation of the system processes is not perfect.
fr: Incertitude structurale, due à l'incertitude dans la structure du modèle. Comme notre connaissance du comportement du système est incomplète, notre implémentation des procès du système ne sera parfaite non plus.

source: Parametric uncertainty, due to the uncertainty about the value of model parameters. The available data and measurements of the system state are limited and they are a partial representation of the studied system. Thus, the estimated values of the parameters based on them are imprecise.
fr: Incertitude paramétrique, due à l'incertitude sur les valeurs des paramètres du modèle. Les données disponibles et les mesures de l'état du système sont limitées et elles sont une représentation partielle du système étudié. Ainsi, les valeurs estimées des paramètres basées sur ces données sont imprécises.

source: Measurement error and natural variability. As a result, there is uncertainty in the boundary conditions of the model (initial state and forcing data) and system state. Natural variability includes different components, such as spatial heterogeneity, environmental variability and genetic variability.
fr: Erreur de la mesure et variabilité naturelle. En conséquence, il y a incertitude sur les conditions de frontière du modèle (état initial et données de forçage) et état du système. La variabilité naturelle inclue différentes composantes, telles que l'hétérogénéité spatiale, la variabilité environnementale et la variabilité génétique.

source: Ideally, with time, we may reduce the uncertainty of simulations by improving our understanding of the system (adapting the structure of the model according to the available data), by reducing measurement error (with more precise data) and by identifying more precisely the value of the parameters (with more and more precise data). However, a certain degree of uncertainty will always remain.
fr: Idéalement, après un certain temps, on peut réduire l'incertitude des simulations par l'amélioration de notre connaissance du système (en adaptant la structure du modèle d'après les données disponibles), par la réduction de l'erreur de mesure (avec de données plus précises) et par l'identification plus précise des valeurs des paramètres (avec plus de données et données plus précises). Cependant, un certain dégrée d'incertitude reste toujours.

source: Beck (1987) identified four types of problems that are the object of uncertainty analysis:
fr: Beck (1987) a identifié quatre types de problèmes qui font l'objet de l'analyse d'incertitudes :

source: Analysing the uncertainty about model structure (or about the relationships between variables characterizing the behaviour of the system). To answer this question we may use different models or model structures.
fr: L'analyse de l'incertitude de la structure du modèle (ou sur les relations entre les variables qui caractérisent le comportement du système). Pour répondre cette question on peut utiliser différents modèles ou structures du modèle.

source: Analysing the uncertainty about the value of the parameters. The objective is to obtain the distribution of parameter values, based on the analysis of which parameter values produce simulations that are consistent with observations of the system behaviour.
fr: L'analyse de l'incertitude de la valeurs des paramètres. L'objectif est d'obtenir la distribution des valeurs des paramètres, en base à l'analyse de quelles valeurs des paramètres donnent des simulations cohérentes avec les observations du comportement du système.

source: Analysing the uncertainty of forecasts made using the model or predictive uncertainty. A priori predictive uncertainty is the uncertainty of forecasts made before incorporating the information of new measurements. A posteriori predictive uncertainty is the uncertainty of forecasts after incorporating new measurements.
fr: L'analyse de l'incertitude des prédictions faites avec le modèle ou incertitude prédictive. L'incertitude prédictive a priori est l'incertitude des prédictions faites avant d'incorporer l'information de nouvelles mesures. L'incertitude prédictive a posteriori est l'incertitude des prédictions après l'incorporation des nouvelles mesures.

source: Designing experiments or monitoring programs to reduce the main uncertainties. This analysis is related with the analysis of identifiability and data worth.
fr: La planification expérimentale ou programmes de surveillance pour réduire les principales incertitudes. Cette analyse est liée à l'analyse d'identifiabilité et la valeur des données.

source: Which uncertainty method to use?
fr: Quelle méthode d'incertitude utiliser ?

source: We find two main approaches to the analysis of predictive uncertainty:
fr: On trouve deux approches principales à l'analyse d'incertitude prédictive :

source: First-order methods. Limited to the linear case, because of the intractability of mathematical solutions in nonlinear cases. Often there is an assumption of Gaussian probability density functions for better tractability. They use linear algebra to estimate uncertainty and require few simulations.
fr: Méthodes de premier ordre. Limitées au cas linéaire, à cause de l'intraitabilité des solutions mathématiques dans les cas non linéaires. Souvent il y a une supposition de fonctions de densité de probabilité normales pour une meilleure traitabilité. Elles utilisent l'algèbre linéaire pour estimer l'incertitude et ont besoin de peu de simulations.

source: Nonlinear methods. These methods can take into account all the complexity of the models. Some examples:
fr: Méthodes non linéaires. Ces méthodes peuvent prendre en considération toute la complexité des modèles. Quelques exemples :

source: Monte Carlo methods. They are based in obtaining a large number of simulations by varying the value of the parameters of the model. They require a large number of simulations.
fr: Méthodes de Monte Carlo. Elles sont basées en l'obtention d'un grand nombre de simulations par le biais de la variation des valeurs des paramètres du modèle. Elles requièrent un grand nombre de simulations.

source: Iterative Ensemble Smoother. It is a technique specially designed to calibrate and quantify the uncertainty of nonlinear models with large numbers of parameters. The number of ensemble members should be greater than the dimensionality of the solution space. For models with a large number of parameters, the computational cost of IES in terms of number of model runs is much smaller than that of Monte Carlo methods.
fr: Lissage Itératif d'Ensemble. C'est une technique spécialement désignée pour calibrer et quantifier l'incertitude des modèles non linéaires avec grands nombres de paramètres. Le nombre de membres de l'ensemble devrait être supérieur à la dimensionnalité de l'espace de solution. Pour les modèles avec un grand nombre de paramètres, le coût computationnel de l'IES en raison du nombre d'exécutions du modèle est beaucoup plus petit que celui des méthodes de Monte Carlo.

source: Although environmental models are largely nonlinear, linear methods may also be applied to them if the uncertainty of model parameters is low enough. This is based on the fact that the behaviour of a nonlinear (continuously derivable) function in an interval around a certain point (the parameter value) can be assumed to be linear if the interval is small enough. We may consider a model has an approximately linear behaviour when the coefficient of determination of the linear regression model is higher than 0.7.
fr: Bien que les modèles environnementaux soient largement non linéaires, les méthodes linéaires peuvent y être appliquées aussi si l'incertitude du modèle est suffisamment petite. Ceci est basé sur le fait que le comportement d'une fonction (continuellement dérivable) non linéaire dans un intervalle autour d'un certain point (la valeur du paramètre) peut être présumé linéaire si l'intervalle est assez petit. On peut considérer qu'un modèle a un comportement approximativement linéaire quand le coefficient de détermination du modèle de régression linéaire est supérieur à 0.7.

source: When choosing a method, we need to take into account computational cost (number of runs and time of calculation of the model) and parameter uncertainty. When the uncertainty about the model parameters is high, it is preferable to use nonlinear methods. In posterior iterations, when we have acquired more data and the uncertainty about the parameter values has decreased enough (and the response of the model can be assumed to be linear), we can use less costly linear methods.
fr: Quand on sélectionne une méthode, il faut prendre en considération le coût computationnel (nombre d'exécutions et temps de calcul du modèle) et incertitude des paramètres. Quand l'incertitude des paramètres du modèle est élevée, il est préférable d'utiliser des méthodes non linéaires. En itérations postérieures, quand on a obtenu plus de données et l'incertitude des valeurs des paramètres a diminué assez (et la réponse du modèle peut être considéré linéaire), on peut utiliser des méthodes linéaires moins coûteux.

source: Data worth
fr: Valeur des données

source: Data worth or value of information is an assessment of the value of data. The worth of data may be related to a cost-benefit analysis, where additional measurements have worth if the reduction in uncertainty overcomes the increased cost. Thus the concept of data worth is especially important for the design of measurement networks and data collection campaigns.
fr: La valeur des données ou de l'information est une évaluation de l'utilité des données. La valeur des données peut être relationnée à un analyse de coût-bénéfice, où les mesures additionnelles ont de la valeur si la réduction en incertitude supère l'incrément du coût. Ainsi le concept de la valeur des données est spécialement important pour la planification de réseaux de mesure et de campagnes de collection de données.

source: Data worth measures the potential of reduction of the uncertainty of relevant management predictions. There are two ways to assess data worth:
fr: La valeur des données mesure le potentiel de réduction de l'incertitude de prédictions relevantes pour la gestion. Il y a deux façons d'évaluer la valeur des données :

source: as the decrease in predictive uncertainty produced if the data were added to the dataset;
fr: comme une diminution de l'incertitude prédictive due à l'addition de données au jeu de données ;

source: as the increase in predictive uncertainty produced if the data were removed from the dataset.
fr: comme une augmentation de l'incertitude prédictive due à l'élimination de données au jeu de données ;

source: However, the most common situation is that new data is added to the system.
fr: Cependant, la situation la plus habituelle est que des nouvelles données soient ajoutées au système.

source: An example: simulation of surface water temperature
fr: Un exemple : simulation de la température de la surface de l'eau

source: To demonstrate the concepts and techniques implemented in this package we will use the study case of the simulation of surface water temperature using one simple model depending on air temperature.
fr: Pour démontrer les concepts et techniques implémentées dans ce paquet nous présentons le cas d'étude de la simulation de la température de la surface de l'eau en utilisant un modèle simple qui dépend de la température de l'air.

source: The relationship between air and water temperatures can be described by a non-linear equation. Mohseni et al. (1998) proposed the following sigmoid equation:
fr: La relation entre les températures de l'air et de l'eau peut être décrite avec une équation non linéaire. Mohseni et al. (1998) a proposé l'équation sigmoïde suivante :

source: In this example, we will apply this model to the case of surface temperature in the reservoir of Naussac. We will use satellite measurements of surface temperature from the LakeSST dataset (Prats et al. 2018) and air temperature from the SAFRAN reanalysis (Quintana-Seguí et al., 2008), shown in the following figure. The data covers the period 1999-2015.
fr: Dans cet exemple, nous appliquons ce modèle au cas de la température de la surface dans la retenue de Naussac. Nous utilisons des mesures par satellite de la température de la surface du jeu de données LakeSST (Prats et al. 2018) et la température de l'air de la réanalyse SAFRAN (Quintana-Seguí et al., 2008), montrées dans la figure suivante. Les données recouvrent la période 1999-2015.

source: The objective of the exercise will be to estimate water temperature and its uncertainty on the 1st and 15th of each month in 2015.
fr: L'objectif de l'exercice est d'estimer la température de l'eau et son incertitude les jours 1er et 15e de chaque mois en 2015.

source: Prior uncertainty
fr: Incertitude a priori

source: Assume we did not have any available data on surface temperature in the reservoir. And assume we need to estimate it. How confidently could we do it? We can answer this question with Monte Carlo simulations.
fr: Supposez que nous n'avons pas de données sur la température de la surface dans le réservoir. Et supposez que nous avons besoin de l'estimer. Quelle confidence peut-on attacher à nous estimations ? On peut répondre cette question avec des simulations de Monte Carlo.

source: Even in the absence of field data, we could still make an estimation based on previous scientific knowledge. We know water temperature is highly correlated to air temperature and that it can be estimated quite accurately using Eq. :eq:`model_2`. Also, many studies have calibrated that model in several instances, so that we can use expert judgement to provide an estimation of the expected value and range of the parameters of the model. The values on the following table are based on the results obtained by Mohseni et al. (1998).
fr: Même si on n'a pas de données de terrain, on peut encore faire une estimation en base aux connaissances scientifiques antérieures. On sait que la température de l'eau est très corrélée à la température de l'air et qu'elle peut être estimée avec assez de précision avec l'Éq. :eq:`model_2`. Aussi, beaucoup d'études ont calibré ce modèle dans plusieurs cas, et en conséquence on peut utiliser l'avis d'expert pour avoir une estimation de la valeur espérée et du rang de variation des paramètres du modèle. Les valeurs de la table suivante sont dérivées depuis les résultats obtenus par Mohseni et al. (1998).

source: A first (expert-based) estimation of model parameters
fr: Une première estimation des paramètres du modèle (basée sur l'avis d'expert)

source: **Parameter**
fr: **Paramètre**.

source: **Mean**
fr: **Moyenne**

source: From these parameters we can draw several random samples (e.g., 500 samples) and carry simulations with each set of parameter values. In this case, since we suppose we do not have any additional information. When there is no information on the shape of the distribution of the parameter values, it is often assumed that they follow a uniform distribution, which can be considered a non-informative distribution.
fr: On peut utiliser ces valeurs pour extraire plusieurs échantillons aléatoires (p. ex., 500 échantillons) des valeurs des paramètres et réaliser une simulation pour chaque jeu de valeurs des paramètres. Dans ce cas, on présume qu'on n'a pas d'information additionnelle. Quand il n'y a pas d'information sur la forme de la distribution des valeurs des paramètres, on assume souvent qu'elles suivent une distribution uniforme, qui peut être considérée comme une distribution non informative.

source: The simulated values for the different parameter sets provide the prior uncertainty of the temperature estimations based on prior knowledge. We can see that, as expected, uncertainty is quite large at this point.
fr: Les valeurs simulées pour les différents jeux de paramètres proportionnent l'incertitude a priori des estimations de la température en base aux connaissances antérieurement existantes. On peut voire que, comme c'était attendu, l'incertitude est assez large en ce moment.

source: To reduce simulation uncertainty, we need to calibrate the model choosing appropriate values for the model parameters. However, before passing to calibration it is helpful to make a sensitivity analysis to find which are the parameters that have a greater influence in the simulation results. Given the large uncertainty at this point, a global sensitivity analysis method should be used. We will use here the method of Sobol.
fr: Pour réduire l'incertitude de la simulation, nous avons besoin de calibrer le modèle et choisir de valeurs appropriées pour les valeurs des paramètres. Cependant, avant de passer à la calibration il est d'utilité de faire une analyse de sensitivité pour investiguer quels sont les paramètres avec une majeure influence sur les résultats de simulation. Vu la large incertitude à ce point-ci, il faudrait utiliser une méthode d'analyse de sensitivité globale. Nous utiliserons ici la méthode de Sobol.

source: The method of Sobol is a Monte Carlo-based method of decomposition of the variance. The objective of the method is to assess the proportion of the output variance that is due to each parameter. This method can reveal the existence of nonlinearity and interactions between parameters. When using this method usually two indexes are calculated: first-order sensitivity index (:math:`S_i`) and total effect index (:math:`S_{T_i}`).
fr: La méthode de Sobol est une méthode de Monte Carlo de décomposition de la variance. L'objectif de la méthode est d'évaluer la proportion de la variance des résultats qui est due à chaque paramètre. Cette méthode peut révéler l'existence de non-linéarité et d'interactions entre paramètres. Quand on utilise cette méthode d'habitude on calcule deux indexes : l'index de sensitivité de premier ordre (:math:`S_i`) et l'index des effets totaux (:math:`S_{T_i}`).

source: Sensitivity of model parameters (Sobol method, 400 samples)
fr: Sensitivité des paramètres du modèle (méthode de Sobol, 400 échantillons)

source: The first order sensitivity index :math:`S_i` measures the proportion of the variance of the model output that is explained by each parameter (without interactions). The index :math:`S_i` theoretically varies between 0 (unsensitive) and 1 (maximum sensitivity). The sum of all :math:`S_i` is equal to 1 for additive models (the effect of the parameters is independent), and it is less than 1 for nonadditive models (there are interactions between the parameters). In this case, the sum of all :math:`S_i` is 0.7. Thus, the variation in individual parameters explains 70% of the output variance and the model may be considered to have a largely linear behaviour, notwithstanding the rather large parameter space explored here.
fr: L'index de sensitivité de premier ordre :math:`S_i` mesure la proportion de la variance du retour du modèle qu'est expliquée par chaque paramètre individuellement (sans interactions). L'index :math:`S_i` varie théoriquement entre 0 (non sensible) et 1 (sensitivité maximale). La somme de tous les :math:`S_i` est égale à 1 pour des modèles additifs (l'effet de chaque paramètre est indépendant), et elle est moins de 1 pour des modèles non-additifs (il y a des interactions entre les paramètres). Dans notre cas, la somme de tous les :math:`S_i` est 0.7. Ainsi, la variation des paramètres individuels explique un 70 % de la variance des sorties et on peut considérer que le modèle a un comportement largement linéaire, au malgré de l'espace des paramètres assez large qu'on a exploré ici.

source: When :math:`S_i` is calculated using the Sobol's method, it may take negative values because of numeric inaccuracies when :math:`S_i` is near zero and the sample size is small.
fr: Quand :math:`S_i` est calculé avec la méthode de Sobol, il peut prendre des valeurs négatives à cause d'imprécisions numériques quand :math:`S_i` est proche de zéro et la taille de l'échantillon est petite.

source: The total effect index :math:`S_{T_i}` measures the contribution to the variance of the model output made by a parameter including interactions with other parameters. The index :math:`S_{T_i}` is equal to :math:`S_i` if there are no interactions between parameter :math:`X_i` and other parameters, and greater than :math:`S_i` if there are interactions with other parameters. If :math:`S_{T_i}=0`, the parameter :math:`X_i` is noninfluential. The sum of all :math:`S_{T_i}` is usually greater than 1; it is 1 only if the model is perfectly additive (no interactions between parameters).
fr: L'index des effets totaux :math:`S_{T_i}` mesure la contribution à la variance des sorties du modèle d'un paramètre en incluant les interactions avec d'autres paramètres. L'index :math:`S_{T_i}` est égal à :math:`S_i` si'l n'y a pas d'interactions entre le paramètre :math:`X_i` et d'autres paramètres, et plus grand que :math:`S_i` s'il y a des interactions avec d'autres paramètres. Si :math:`S_{T_i}=0`, le paramètre :math:`X_i` n'a aucune influence. La somme de tous les :math:`S_{T_i}` est habituellement supérieure à 1 ; c'est 1 seulement si le modèle est parfaitement additif (pas d'interactions entre paramètres).

source: In our example, the parameters :math:`\alpha` and :math:`\beta` are the most influential parameters: fixing the value of one of them would reduce the output variance by more than 50%. The paramater :math:`\gamma` is much less influential. And the parameter :math:`\mu` is noninfluential since its total effect index is nearly zero. Also, since the sum of :math:`S_i` is less than 1, the sum of :math:`S_{T_i}` is greater than 1, and :math:`S_{T_i}>S_i` for the parameters :math:`\alpha`, :math:`\beta` and :math:`\gamma`, there are interactions between these parameters.
fr: Dans notre exemple, les paramètres :math:`\alpha` et :math:`\beta` sont les paramètres les plus influents : la fixation de la valeur d'un entre eux réduirait la variance des sorties de plus d'un 50 %. Le paramètre :math:`\gamma` est beaucoup moins influent. Et le paramètre :math:`\mu` n'a pas d'influence puisque son index d'effets totaux est presque zéro. De plus, comme la somme de :math:`S_i` est moins de 1, la somme de :math:`S_{T_i}` est plus de 1, et :math:`S_{T_i}>S_i` pour les paramètres :math:`\alpha`, :math:`\beta` et :math:`\gamma`, il y a des interactions entre ces paramètres.
