Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: This package allows you to carry several types of analysis:
fr: Ce paquet vous permet de réaliser plusieurs types d'analyses :

source: Model calibration (aka parameter estimation, history matching). There are four possible options:
fr: Calibration du modèle (ou estimation des paramètres). Il y a quatre options possibles :

source: Gauss-Levenberg-Marquardt (GLM) algorithm, using the function :func:`calibration`. It is a gradient algorithm for overdetermined cases.
fr: Algorithme de Gauss-Levenberg-Marquardt (GLM), en utilisant la fonction :func:`calibration`. Est algorithme de descente de gradient pour des cas surdéterminés.

source: GLM algorithm with Tikhonov regularisation, using the function :func:`calibration`. For under-determined cases.
fr: Algorithme GLM avec régularisation de Tikhonov, en utilisant la fonction :func:`calibration`. Pour des cas sous-déterminés.

source: Differential Evolution (DE), using the function :func:`calibration`. It is a global algorithm with longer time of computation than the previous two options.
fr: Évolution Différentielle (DE), en utilisant la fonction :func:`calibration`. C'est un algorithme global avec un temps de calcul plus long que les deux options antérieures.

source: Iterative ensemble smoother, using the function :func:`ies`. It is also a global algorithm, especially useful for nonlinear models with a large number of parameters, that obtains several sets of parameter values that can be considered to be calibrated.
fr: Lissage itératif d'ensemble, en utilisant la fonction :func:`ies`. Il est aussi un algorithme global, spécialement utile pour des modèles non-linéaires avec un grand nombre de paramètres, qui obtient plusieurs jeux de valeurs des paramètres qui peuvent être considérés comme des valeurs calibrées.

source: Prior (before calibration) and posterior (after calibration) uncertainty analysis. There are the following options:
fr: Analyse d'incertitudes a priori (avant calibration) et a posteriori (après calibration). Il y a les options suivantes :

source: Linear uncertainty analysis, using the function :func:`linear_uncertainty`. Appropriate for linear or quasi-linear models. It may be applicable to a nonlinear model if the behaviour of the model in the parameter space is approximately linear (:math:`R^2 > 0.7`). It requires a low computation time, once the model is calibrated. The following options are available:
fr: Analyse linéaire d'incertitudes, avec la fonction :func:`linear_uncertainty`. Approprié pour des modèles linéaires ou presque linéaires. Il peut être appliquée à des modèles non-linéaires si le comportement du modèle dans l'espace des paramètres est approximativement linéaire (:math:`R^2 > 0.7`). Il a besoin d'un court temps de calcul une fois le modèle calibré. Les options suivantes sont disponibles :

source: Prior linear uncertainty analysis.
fr: Analyse linéaire d'incertitudes a priori.

source: Schur's complement analysis for conditional uncertainty propagation.
fr: Analyse du complément de Schur pour la propagation d'incertitude conditionnelle.

source: Error variance analysis. It also includes identifiability estimation.
fr: Analyse de la variance de l'erreur. Il inclue aussi l'estimation de l'identifiabilité.

source: Nonlinear uncertainty analysis. Preferable when the model is not linear. However, calculation times are longer.
fr: Analyse non-linéaire d'incertitudes Préférable quand le modèle est non-linéaire. Pourtant, les temps de calcul sont plus longs.

source: Monte Carlo simulations, using the function :func:`monte_carlo`. It usually requires a large number of simulations (>1000).
fr: Simulations de Monte Carlo, avec la fonction :func:`monte_carlo`. D'habitude il a besoin d'un grand nombre de simulations (>1000).

source: Iterative ensemble smoother, using the function :func:`ies`. It requires a much lower number of simulations than Monte Carlo methods.
fr: Lissage itératif d'ensemble, en utilisant la fonction :func:`ies`. Il a besoin d'un nombre de simulations beaucoup moindre que les méthodes de Monte Carlo.

source: Sensitivity analysis. There are two options:
fr: Analyse de sensitivité Il y a deux options :

source: Local sensitivity analysis. Low computation time. It is calculated during calibration using the function :func:`calibration`.
fr: Analyse de sensitivité locale. Court temps de calcul. Les calculs sont réalisés pendant la calibration en utilisant la fonction :func:`calibration`.

source: Global sensitivity analysis (GSA). Applied using the function :func:`gsa`. Two implemented methods:
fr: Analyse de sensitivité globale (GSA). Appliqué en utilisant la fonction :func:`gsa`. Deux méthodes implémentées :

source: Morris's method (one parameter at a time). Low computation time.
fr: Méthode de Morris (un paramètre à la fois). Court temps de calcul.

source: Sobol's method (all parameters vary at the same time). High computation time.
fr: Méthode de Sobol (tous les paramètres varient au même temps). Long temps de calcul.

source: In all cases calculations can be parallelized using the argument ``parallel=True``.
fr: Dans tous les cas les calculs peuvent être parallélisés en utilisant l'argument ``parallel=True``.

source: The following table shows the computational cost of several :mod:`cuspy` functions in terms of number of model runs and run time. Run time calculations are based on the cases presented in the :file:`tests` folder and were made using an Ubuntu virtual machine with 4 processors of 3067 MHz. These tests consist in the application of different :mod:`cuspy` functions to the OKP water temperature model with 8 adjustable parameters.
fr: La table suivante montre le coût computationnel de plusieurs fonctions de :mod:`cuspy` en nombre d'exécutions du modèle et de temps de calcul. Les valeurs de temps de calcul sont basées sur les cas du dossier :file:`tests` et ont été obtenues pour une machine virtuelle Ubuntu avec 4 processeurs de 3067 MHz. Ces tests consistent en l'application de différentes fonctions :mod:`cuspy` au modèle OKP de température de l'eau avec 8 paramètres ajustables.

source: Computational cost of different types of analyses
fr: Coût computationnel de différents types d'analyse

source: **Function**
fr: **Fonction**

source: **Details**
fr: **Détails**

source: **Parallelized**
fr: **Parallélisé**

source: **N. runs**
fr: **N. exécutions**

source: **Run time (s)**
fr: **Temps calcul (s)**

source: Yes
fr: Oui

source: No
fr: Non

source: The number of simulations (``n_reals``) used in Monte Carlo experiences is usually of the order of thousands and greater. Thus calculation time is usually much greater than shown here.
fr: Le nombre de simulations (``n_reals``) utilisé dans des expériences de Monte Carlo est d'habitude de l'ordre de milliers ou plus. En conséquence le temps de calcul est beaucoup plus grand que celui montré ici.

source: Calibration with GLM or DE
fr: Calibration avec GLM ou DE

source: To calibrate a model you can use the function :func:`calibration`. For example:
fr: Pour calibrer un modèle vous pouvez utiliser la fonction :func:`calibration`. Par exemple :

source: The pest instance returned by the function can be used to access the results of the calibration. To obtain the calibrated parameter values, type:
fr: L'instance PEST retournée par la fonction peut être utilisées pour accéder aux résultats de la calibration. Pour obtenir les valeurs des paramètres calibrées, tapez :

source: To obtain the simulated values and residuals, type:
fr: Pour obtenir les valeurs simulées et les résidus, tapez :

source: And to obtain a summary of these, type:
fr: Et pour en obtenir un résumé, tapez :

source: You may plot the results using:
fr: Vous pouvez tracer les résultats en utilisant :

source: In addition, a certain number of useful files is written by PEST++. Please, see the PEST++ user guide to obtain information on these files.
fr: De plus, un a certain nombre de fichiers utiles sont écrits par PEST++. Veuillez voire le manuel d'utilisation de PEST++ pour vous renseigner sur ces fichiers.

source: Global sensitivity analysis
fr: Analyse de sensitivité globale

source: Two methods can be used to carry a global sensitivity analysis: Morris's method and Sobol's method. You need to use the function :func:`gsa`, by choosing the desired method ('sobol' or 'morris') and configuring the method using the `pestpp_opts` argument. For example:
fr: Deux méthodes peuvent être utilisées pour réaliser un analyse de sensitivité globale : méthode de Morris et méthode de Sobol. Vous devez utiliser la fonction :func:`gsa`, et choisir la méthode désirée ('sobol' ou 'morris') et configurer la méthode en utilisant l'argument `pestpp_opts`. Par exemple :

source: Linear uncertainty analysis
fr: Analyse linéaire d'incertitudes

source: Once the function is calibrated, you can make a linear uncertainty analysis using the function :func:`linear_uncertainty`. For example:
fr: Une fois la fonction a été calibrée, vous pouvez réaliser un analyse linéaire d'incertitudes avec la fonction :func:`linear_uncertainty`. Par exemple :

source: Prior uncertainty
fr: Incertitude a priori

source: The :class:`LinearAnalysis` object returned by the function can be used to access the results of the uncertainty analysis. To obtain the prior uncertainty of predictions, type:
fr: L'objet :class:`LinearAnalysis` retourné par la fonction peut être utilisé pour accéder aux résultats de l'analyse d'incertitudes. Pour obtenir l'incertitude a priori des prédictions, tapez :

source: Posterior uncertainty
fr: Incertitude a posteriori

source: To carry a Schur's complement analysis, you need to set ``analysis='schur'``. For example:
fr: Pour réaliser un analyse du complément de Schur, vous devez le choisir avec ``analysis='schur'``. Par exemple :

source: With Schur's complement analysis you can obtain the posterior uncertainty typing:
fr: Avec l'analyse du complément de Schur vous pouvez obtenir l'incertitude a posteriori si vous tapez :

source: To obtain prior and posterior uncertainties for the predictions of interest and the reduction in uncertainty due to calibration ('schur'), type:
fr: Pour obtenir les incertitudes a priori et a posteriori pour les prédictions d'intérêt et la réduction de l'incertitude due à la calibration ('schur'), tapez :

source: Similarly, you can obtain information on the reduction of parameter uncertainty through calibration by typing:
fr: De façon similaire, vous pouvez obtenir information sur la réduction de l'incertitude des paramètres par la calibration si vous tapez :

source: Data worth
fr: Valeur des données

source: It is possible to analyse data worth with the :class:`Schur` object returned by the function :func:`linear_uncertainty`. The following instructions return the variance of the predictions after adding a new observation or group of observations:
fr: Il est possible d'analyser la valeur des données avec l'objet :class:`Schur` retourné par la fonction :func:`linear_uncertainty`. Les instructions suivantes retournent la variance des prédictions après l'ajout d'une nouvelle observation ou groupe d'observations :

source: A similar analysis can be made by removing observations or groups of observations with the methods :meth:`get_removed_obs_importance` and :meth:`get_removed_obs_group_importance`.
fr: Un analyse similaire peut être fait par l'élimination d'observations ou groupes d'observations avec les méthodes :meth:`get_removed_obs_importance` et :meth:`get_removed_obs_group_importance`.

source: To obtain the contribution of each parameter to prediction uncertainty, type:
fr: Pour obtenir la contribution de chaque paramètre à l'incertitude de prédiction, tapez :

source: Predictive error
fr: Erreur prédictive

source: To analyse predictive error with an error variance analysis you need to set ``analysis='err_var'``. For example:
fr: Pour analyser l'erreur prédictive avec un analyse de la variance de l'erreur vous devez le configurer avec ``analysis='err_var'``. Par exemple :

source: The :class:`ErrVar` object returned by the function :func:`linear_uncertainty` allows to access the results of the error variance analysis:
fr: L'objet :class:`ErrVar` retourné par la fonction :func:`linear_uncertainty` peut être utilisé pour accéder aux résultats de l'analyse de la variance de l'erreur :

source: Identifiability
fr: Identifiabilité

source: With the :class:`ErrVar` object, it is also possible to access the results of the identifiability analysis with:
fr: Avec l'objet :class:`ErrVar`, il est possible aussi d'accéder aux résultats de l'analyse d'identifiabilité avec :

source: Monte Carlo simulations
fr: Simulations de Monte Carlo

source: To carry Monte Carlo simulations with the :mod:`cuspy` package you can use the function :func:`monte_carlo`. For example:
fr: Pour réaliser des simulations de Monte Carlo avec le paquet :mod:`cuspy` vous pouvez utiliser la fonction :func:`monte_carlo`. Par exemple :

source: The sets of parameter values drawn from the specified distribution are saved in the `csv_in` file (:file:`sweep_in.csv` by default). The simulation results are also saved to a csv file, named :file:`sweep_out.csv` by default. The name of the output csv file can be modified using the `pestpp_opts` argument:
fr: Les jeux de valeurs des paramètres extraits de la distribution spécifiée sont sauvegardés dans le fichier `csv_in` (:file:`sweep_in.csv` par défaut). Les résultats de simulation sont sauvegardés aussi dans un fichier csv, qui s'appelle :file:`sweep_out.csv` par défaut. Le nom du fichier de sortie csv peut être modifié en utilisant l'argument `pestpp_opts` :

source: Monte Carlo simulations can have several uses, including calibration, global sensitivity analyses and uncertainty analyses, depending on how the simulation results are analysed. No particular type of analysis is implemented in this package, but they can be easily implemented based on the treatment of the input and output csv files (`csv_in` and `sweep_output_csv_file`).
fr: Les simulations de Monte Carlo peuvent être utiles à plusieurs finalités, incluses calibration, analyse de sensitivité global et analyse d'incertitude, en fonction du traitement qu'on fait des résultats de simulations. Aucun type particulier d'analyse n'est implémenté dans ce paquet, mais ils peuvent être implémentés facilement par le biais du traitement des fichiers csv d'entrée et de sortie (`csv_in` et `sweep_output_csv_file`).

source: Iterative Ensemble Smoothing
fr: Lissage Itératif d'Ensemble

source: To apply the IES method, you need to use the function :func:`ies`. For example:
fr: Pour appliquer la méthode, vous devez utiliser la fonction :func:`ies`. Par exemple :

source: The implementation of the IES method uses the GLM algorithm (called with `pestpp-glm`), which can be configured using the `pst_file0` and `control_data` arguments. The IES method can be configured with the `pestpp_opts` argument.
fr: L'implémentation de la méthode IES utilise l'algorithme GLM (appelé avec `pestpp-glm`), qui peut être configuré en utilisant les arguments `pst_file0` et `control_data`. La méthode IES peut être configurée avec l'argument `pestpp_opts`.

source: The output of the :func:`ies` function can be found in a series of csv files. The optimized parameter value sets can be found in the file :file:`case.N.par.csv`, where "case" is the name of the pest file `pst_file1` and "N" is the number of the latest iteration. The simulation results for each parameter set can be found in the file :file:`case.N.obs.csv`. The objective function results during all iterations can be found in the files :file:`case.phi.actual.csv` (objective function calculated from differences between forecasts and observations), :file:`case.phi.meas.csv` (objective function calculated from differences between forecasts and noisy observations), :file:`case.phi.group.csv` (objective function calculated by parameter and observation groups) and :file:`case.phi.regul.csv` (regularization objective functions).
fr: Le retour de la fonction :func:`ies` peut être trouvé dans une série de fichiers csv. Les jeux de valeurs des paramètres optimisées se trouvent dans le fichier :file:`cas.N.par.csv`, où "cas" est le nom du fichier PEST `pst_file1` et "N" est le numéro de la dernière itération. Les résultats de simulation pour chaque jeu de paramètres se trouve dans le fichier :file:`case.N.obs.csv`. Les résultats de la fonction d'objectifs pour toutes les itérations se trouve dans les fichiers :file:`case.phi.actual.csv` (fonction d'objectifs calculée par rapport aux différences entre prédictions et observations), :file:`case.phi.meas.csv` (fonction d'objectifs calculée par rapport aux différences entre prédictions et observations avec du bruit), :file:`case.phi.group.csv` (fonction d'objectifs calculée par paramètre et groupe d'observation) et :file:`case.phi.regul.csv` (fonction d'objectifs avec régularisation).

source: References
fr: Références
