Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/source/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: Usage
fr: Utilisation

source: The :mod:`cuspy` package can be applied to a large class of models, on the condition that:
fr: Le paquet :mod:`cuspy` peut être appliqué à une large variété de modèles, à condition que :

source: the model can be run using the command line (e.g., through an executable that is available in the path or a call to a script).
fr: le modèle puisse être exécuté avec la ligne de commandes (p. ex., par le biais d'un exécutable disponible dans le chemin ou un appel à un script).

source: the communication between the model and the user (output data, parameter values) is made by means of text files (or the script calling the model reads data in binary form and creates output in text form).
fr: la communication entre le modèle et l'utilisateur (données de sortie, valeurs des paramètres) se fait par le moyen de fichiers texte (ou le script qui appelle le modèle lit des données en forme binaire et créé la sortie en forme de texte).

source: In addition, the package has been specially designed to work with dynamic models the output of which is in several columns, the first of which is date. Working with models with other type of output is possible, but it requires more implication of the user in the preparation of the PEST instruction files.
fr: De plus, le paquet a été spécialement désigné pour travailler avec des modèles dynamiques avec un retour sur plusieurs colonnes, la première desquelles est la date. Il est possible de travailler avec des modèles avec un autre type de sortie, mais il faut une majeure implication de l'utilisateur dans la préparation des fichiers d'instructions PEST.

source: Command line application
fr: Application en ligne de commande

source: Python module
fr: Module Python

source: To use :mod:`cuspy` as a Python module you can simply import it and use the functions within::
fr: Pour utiliser :mod:`cuspy` comme un module Python vous pouvez simplement l'importer et utiliser les fonctions qu'il contient :

source: You can include the previous commands in a Python script (see the scripts in the folder :file:`tests`). To run a python script from the command line, type:
fr: Vous pouvez inclure les commandes précédentes dans un script Python (voyez les scripts d'exemple dans le dossier :file:`tests`). Pour exécuter un script python script en ligne de commande, tapez :

source: Analysis process
fr: Le procès d'analyse

source: Preparation of the model
fr: Préparation du modèle

source: Before starting the analyses, you need to prepare all the input files and scripts required by the model.
fr: Avant de commencer les analyses, vous devez préparer tous les fichiers d'entrée et les scripts dont le modèle a besoin.

source: In particular, it must be possible to execute the model using a command line instruction of the type:
fr: En particulier, il doit être possible d'exécuter le modèle en utilisant une commande en ligne de commandes comme la suivante :

source: Alternatively, if the model has binary output or several output files, you may need to create a script to process the model output so that it conforms with the recommended format (text file separated by spaces with the date in the first column). For example:
fr: Alternativement, si le modèle a des sorties binaires ou plusieurs fichiers de sortie, vous pourrez avoir besoin de créer un script pour traiter le retour du modèle de façon qu'il soit conforme au format conseillé (fichier texte séparé par des espaces avec la date sur la première colonne). Par exemple :

source: Plus, the model must read the values of its parameters from a text file organised in two columns separated by spaces containing parameter names and values. For example:
fr: De plus, le modèle doit lire les valeurs des paramètres depuis un fichier texte organisé en deux colonnes séparées par des espaces et qui contiennent les noms des paramètres et leurs valeurs. Par exemple :

source: Creation of PEST files
fr: Création des fichiers PEST

source: The first stage in the use of the :mod:`cuspy` package is the creation of the PEST files. You can do this manually, or you can use the function :func:`write_pest_files`. The following is an example of the instruction to create the PEST files for the OKP model.
fr: Le premier étage dans l'utilisation du paquet :mod:`cuspy` est la création des fichiers PEST. Vous pouvez faire ça manuellement, ou vous pouvez utiliser la fonction :func:`write_pest_files`. Le suivant est un exemple de la commande pour créer les fichiers PEST pour le modèle OKP.

source: In the previous example, we can notice the following facts:
fr: Dans l'exemple antérieur, on peut noter deux points :

source: ``start_date`` and ``end_date`` correspond to the initial and final dates of the simulation.
fr: ``start_date`` et ``end_date`` correspondent aux dates initiale et finale de la simulation.

source: ``par_file`` and ``output_file`` are the names of the model's parameter and output files.
fr: ``par_file`` et ``output_file`` sont les noms du fichier de paramètres du modèle et des fichiers de sortie.

source: ``par_data_file``, ``obs_file`` and ``pred_file`` are space-separated text files used to pass parameter and observation data to the function. These must be prepared by the user.
fr: ``par_data_file``, ``obs_file`` et ``pred_file`` sont des fichiers texte séparés par des espaces utilisés pour passer les données des paramètres et des observations a la fonction. Ces fichiers-ci doivent être préparés par l'utilisateur.

source: ``model_command`` is the command line instruction used to run the model. In this case, the model OKP is run using the instruction ``run_okp`` of the :mod:`okplm` package.
fr: ``model_command`` est la commande de ligne de commandes utilisée pour exécuter le modèle. Dans ce cas, le modèle OKP est exécuté avec la commande ``run_okp`` du paquet :mod:`okplm`.

source: ``control_data``, ``svd_data`` and ``pestpp_opts`` are dictionaries used to set the values of variables in the control data, singular value decomposition and PEST++ control data sections of the pest control file.
fr: ``control_data``, ``svd_data`` et ``pestpp_opts`` sont des dictionnaires utilisés pour configurer les valeurs des variables dans les sections dédiées aux données de contrôle, à la décomposition en valeurs singulières et aux données de contrôle de PEST++ du fichier de contrôle PEST.

source: ``tpl_file``, ``ins_file`` and ``pst_file`` are the names of PEST files created by the function. The ``tpl_file`` is a template of the parameter file ``par_file`` used by PEST++ to modify it. The ``ins_file`` is a file indicating PEST++ which values in the ``output_file`` correspond to observations and predictions. The ``pst_file`` controls the execution of the PEST++ executables.
fr: ``tpl_file``, ``ins_file`` and ``pst_file`` sont les noms des fichiers PEST créés par la fonction. Le fichier ``tpl_file`` est un fichier modèle du fichier de paramètres ``par_file`` utilisé par PEST++ pour le modifier. Le ``ins_file`` est un fichier qui indique à PEST++ quelles valeurs du fichier ``output_file`` correspondent aux observations et quelles aux prédictions. Le ``pst_file`` contrôle l'exécution des exécutables de PEST++.

source: We describe next some of the files used by :func:`write_pest_files`. For more information on other arguments (including some not used above), please see the function's description in the Modules section.
fr: On décrit à continuation quelques-uns des fichiers utilisés par :func:`write_pest_files`. Pour plus d'information sur les autres arguments (incluant quelques-uns non-utilisés ci-dessus), veuillez voire la description de la fonction dans la section Modules.

source: The PEST control file (``pst_file``)
fr: Le fichier de contrôle (``pst_file``)

source: The PEST control file contains all the information necessary to control the execution of the PEST++ executables. It is automatically written by the function :func:`write_pest_files` and it is divided in the following sections:
fr: Le fichier de contrôle PEST contient toute l'information nécessaire pour contrôler l'exécution des exécutables de PEST++. Il est écrit automatiquement par la fonction :func:`write_pest_files` et il contient les sections suivantes :

source: **control data** (mandatory)
fr: **control data** (obligatoire)

source: automatic user intervention (optional)
fr: automatic user intervention (optionnelle)

source: **singular value decomposition** (optional)
fr: **singular value decomposition** (optionnelle)

source: lsqr (optional)
fr: lsqr (optionnelle)

source: sensitivity reuse (optional)
fr: sensitivity reuse (optionnelle)

source: svd assist (optional)
fr: svd assist (optionnelle)

source: **parameter groups** (mandatory)
fr: **parameter groups** (obligatoire)

source: **parameter data** (mandatory)
fr: **parameter data** (obligatoire)

source: **observation groups** (mandatory)
fr: **observation groups** (obligatoire)

source: **observation data** (mandatory)
fr: **observation data** (obligatoire)

source: derivatives command line (optional)
fr: derivatives command line (optionnelle)

source: **model command line** (mandatory)
fr: **model command line** (obligatoire)

source: **model input** (mandatory)
fr: **model input** (obligatoire)

source: **model output** (mandatory)
fr: **model output** (obligatoire)

source: prior information (optional)
fr: prior information (optionnelle)

source: predictive analysis (optional)
fr: predictive analysis (optionnelle)

source: **regularization** (optional)
fr: **regularization** (optionnelle)

source: pareto (optional)
fr: pareto (optionnelle)

source: **PEST++ variables** (optional) [#first]_
fr: **PEST++ variables** (optionnelle) [#first]_

source: At the moment :mod:`cuspy` functions can be used to configure the sections in bold, which include all mandatory sections and some optional ones. If necessary, the other sections can be configured manually. For details on the file structure and variables, please see PEST++ user manual.
fr: Pour le moment les fonctions de :mod:`cuspy` peuvent être utilisées pour configurer les sections en graisse, et elles incluent toutes les sections obligatoires et quelques-unes d'optionnelles. Si c'est nécessaire, les autres sections peuvent être configurées manuellement. Pour des détails sur la structure du fichier et ses variables, veuillez voire le manuel d'utilisation de PEST++.

source: Declarations of PEST++ variables (the string "++" followed by the variable name and value) can be located anywhere in the PEST control file, but they are placed at the end of the file by :func:`write_pest_files`.
fr: Les déclarations des variables de PEST++ (la chaîne "++" suivie par le nom et valeur de la variable) peuvent être localisées n'importe où dans le fichier de contrôle de PEST, mais elles sont placées à la fin du fichier par :func:`write_pest_files`.

source: The parameter data file (``par_data_file``)
fr: Le fichier de données des paramètres (``par_data_file``)

source: In the example above, ``par_data_file`` is a text file separated by spaces containing the data of the parameter section of the PEST control file. This file must be provided by the users, based on their previous knowledge of the optimum parameter values and acceptable ranges of variation.
fr: Dans l'exemple ci-dessus, ``par_data_file`` est un fichier texte séparé par des espaces qui contiennent les données de la section des paramètres du fichier de contrôle de PEST. Ce fichier doit être donné par l'utilisateur, sur la base de ses connaissances antérieures des valeurs des paramètres optimales et des rangs de variation acceptables.

source: An example is shown below.
fr: On montre un exemple ci-dessous.

source: The first line of the file contains the column names, described below:
fr: La première ligne du fichier contient les noms des colonnes, décrits ci-dessous :

source: ``parnme``: parameter name (up to 200 characters, case insensitive).
fr: ``parnme`` : nom du paramètre (jusqu'à 200 caractères, sans distinction de majuscules et minuscules).

source: ``partrans``: parameter transformation. It takes one of four possible values:
fr: ``partrans`` : transformation du paramètre. Elle prend une de quatre valeurs possibles :

source: ``'none'``: no transformation applied to the parameter.
fr: ``'none'`` : aucune transformation n'est appliquée au paramètre.

source: ``'log'``: the parameter is log-transformed.
fr: ``'log'`` : on applique une transformation logarithmique au paramètre.

source: ``'fixed'``: constant or non-adjustable parameter.
fr: ``'fixed'`` : paramètre constant ou non-ajustable.

source: ``'tied'``: the parameter is tied to another parameter (not implemented in :mod:`cuspy`).
fr: ``'tied'`` : le paramètre est lié à un autre paramètre (option non implémentée dans :mod:`cuspy`).

source: ``parchglim``: parameter change limit. It is used by the PEST++ executables `pestpp-glm` and (optionally) `pestpp-ies` to limit the change a parameter can suffer at each iteration of the optimization process. It can take the values:
fr: ``parchglim`` : limite de changement du paramètre. Elle est utilisée par les exécutables de PEST++ `pestpp-glm` et (en option) `pestpp-ies` pour limiter le changement qu'un paramètre peut subir à chaque itération du procès d'optimisation. Elle peut prendre les valeurs :

source: ``'relative'``: a relative limit is used, i.e., the value of the parameter :math:`b` must fulfill the condition :math:`|b-b_0|/|b_0| \leq r`, where :math:`b_0` is the parameter value at the start of the iteration and :math:`r` is the value of the PEST control variable ``relparmax`` (=10 by default).
fr: ``'relative'`` : une limite relative est utilisée, soit, la valeur du paramètre :math:`b` doit avérer la condition :math:`|b-b_0|/|b_0| \leq r`, où :math:`b_0` est la valeur du paramètre au début de l'itération et :math:`r` est la valeur de la variable de contrôle de ``relparmax`` (=10 par défaut).

source: ``'factor'``: a factor limit is used,, i.e., the value of the parameter :math:`b` must be within the limits :math:`|b_0/f| \leq b \leq |fb_0|`, where :math:`b_0` is the parameter value at the start of the iteration and :math:`f` is the value of the PEST control variable ``facparmax`` (=10 by default).
fr: ``'factor'`` : un facteur est utilisé comme limite, soit, la valeur du paramètre :math:`b` doit être dans les limites :math:`|b_0/f| \leq b \leq |fb_0|`, où :math:`b_0` est la valeur du paramètre au début de l'itération et :math:`f` est la valeur de la variable de contrôle de PEST ``facparmax`` (=10 par défaut).

source: ``parval1``: initial parameter value. It should be the best estimate of the parameter value before calibration based on expert knowledge.
fr: ``parval1`` : valeur initiale du paramètre. Elle devrait être la meilleure estimation de la valeur du paramètre avant de la calibration sur la base de l'avis d'expert.

source: ``parlbnd`` and ``parubnd``: lower and upper bounds of the parameter value. If an uncertainty file is provided [#second]_, they represent the minimum and maximum values that the parameter can take. If an uncertainty file is not provided, they are understood to represent the 95% confidence interval (a width of 4 standard deviations) [#third]_ of the parameter value.
fr: ``parlbnd`` et ``parubnd`` : seuils inférieur et supérieur de la valeur du paramètre. Si un fichier d'incertitude est donné [#second]_, ils représentent les valeurs minimales et maximales que le paramètre peut prendre. Si un fichier d'incertitudes n'est pas donné, ils représentent l’intervalle de confidence du 95 % (une largeur de 4 déviations standard) [#third]_ de la valeur du paramètre.

source: ``pargp``: parameter group name to which the parameter has been assigned.
fr: ``pargp`` : nom du groupe de paramètres auquel appartient le paramètre.

source: ``scale`` and ``offset``: multiplier (1.0 by default) and offset (0.0 by default) to apply to a parameter before being written to a model input file. It can be used to modify the parameter range of a parameter to a more convenient one (e.g., if the parameters takes negative values and a log transformation is envisaged).
fr: ``scale`` et ``offset`` : multiplicateur (1.0 par défaut) et écart (0.0 par défaut) qu'on applique au paramètre avant de l'écrire dans le fichier d'entrée du modèle. Ils peuvent être utilisés pour modifier le rang d'un paramètre pour un de plus intéressant (p. ex., si le paramètre prend des valeurs négatives et on veut utiliser une transformation logarithmique).

source: ``dercom``: integer indicating the line of the "model command line" section in the PEST control file that is used to calculate derivatives for a given parameter. Usually there is only one command (``dercom=1``).
fr: ``dercom`` : entier qui indique la ligne de la section "model command line" du fichier de contrôle de PEST utilisée pour calculer les dérivées pour un paramètre donné. D'habitude il y a une seule commande (``dercom=1``).

source: An uncertainty file can be provided with the PEST++ control variable ``parcov``.
fr: Un fichier d'incertitude peut être donné avec la variable de contrôle de PEST++ ``parcov``.

source: The width of the interval can be modified with the PEST++ control variable ``par_sigma_range``.
fr: La largeur de l'intervalle peut être modifiée avec la variable de contrôle de PEST++ ``par_sigma_range``.

source: The observations
fr: Les observations

source: The files :file:`obs.txt` and :file:`pred.txt` contain observations or measurements. They have the same format as the model output file, but include only the available observations. It is necessary to provide at least one of these files.
fr: Les fichiers :file:`obs.txt` et :file:`pred.txt` contiennent des observations ou mesures. Ils doivent avoir le même format que le fichier de sortie du modèle, mais ils incluent seulement les observations disponibles. Il faut donner au moins un de ces fichiers.

source: One way of looking at the data in :file:`obs.txt` is as the data used in the calibration or history matching process. The observations in :file:`obs.txt` receive a positive weight (1 by default) and if there is missing data (coded as NA, NaN or nan), the corresponding rows will be ignored. The observation weights can be modified with the argument ``obs_weights``. This is useful when some measurements are more uncertain than others.
fr: Une façon d'interpréter les données dans :file:`obs.txt` est de les considérer comme les données utilisées dans le procès de calibration. Les observations dans :file:`obs.txt` prennent un poids positif (1 par défaut) et s'il y a des données manquantes (codées comme NA, NaN ou nan), les files correspondantes seront ignorées. Les poids des observations peuvent être modifiées avec l'argument ``obs_weights``. Ce-ci est d'utilité quand quelques mesures sont plus incertaines que d'autres.

source: Instead, the observations in the :file:`pred.txt` file or predictions, may be seen as validation data or dates for which a forecast is desired. They receive a null weight and their value is not used in calculations.
fr: Par contre, les observations dans le fichier :file:`pred.txt` ou prédictions, peuvent être vues comme les données de validation ou les dates pour lesquelles on désire d'avoir une prévision. Elles prennent un poids nul et leur valeur n'est pas utilisée dans les calculs.

source: Observations can be assigned to different groups using the arguments ``obs_groups`` and ``pred_groups``. By assigning observations to different groups, we obtain a multiple-component objective function. For example, in the OKP model, that estimates epilimnion and hypolimnion temperatures, measurements for each of these two compartments may be placed in different groups.
fr: Les observations peuvent être assignées à des différents groupes avec les arguments ``obs_groups`` et ``pred_groups``. Si on assigne les observations à différents groupes, on obtient une fonction d'objectifs multiples. Par exemple, pour le modèle OKP, qu'estime la température de l'épilimnion et de l'hypolimnion, les mesures pour chaque de ces deux compartiments peuvent être placées dans de groupes différents.

source: For more complex models this is still more useful. For example, in the GLM model, the user could have temperature measurements taken within the lake, water temperatures at the outlet, satellite temperatures at the surface, water level measurements, salinity measured within the lake and salinity at the outlet. All these different types of measurement could be assigned to different groups. Or, if the study is interested in only one aspect, use only one of those sets of data (and only one group) to calibrate the model.
fr: Pour des modèles plus complexes ce-ci est encore de majeur utilité. Par exemple, pour le modèle GLM, l'utilisateur pourrait avoir des mesures de température prises dans le lac, température de l'eau à l'exutoire, températures à la surface mesurées par satellite, mesures du niveau d'eau, salinité mesurée dans le lac et salinité à l'exutoire. Tous ces différents types de mesures pourraient être assignés à des différents groupes. Ou, si l'étude s'intéresse d'un seul aspect, un seul de ces jeux de données (et un seul groupe) pourrait être utilisé pour calibrer le modèle.

source: Still, Doherty & Welter (2010) recommend using multiple-component objective functions as a way of reducing the influence of model structural error on the calibration.
fr: Cependant, Doherty & Welter (2010) recommandent d'utiliser des fonctions d'objectifs multiples comme à moyen pour réduire l'influence de l'erreur structurale du modèle sur la calibration.

source: The uncertainty file
fr: Le fichier d'incertitude

source: Information on prior parameter uncertainty can be provided to PEST++ through an uncertainty file using the PEST++ control variable ``parcov``. This file can take several forms:
fr: On peut passer de l'information à PEST++ sur l'incertitude a priori des paramètres par le moyen d'un fichier d'incertitude avec la variable de contrôle de PEST++ ``parcov``. Ce fichier peut prendre plusieurs formes :

source: A parameter uncertainty file (.unc). It contains standard deviations for individual parameters that have no statistical correlation with other parameters and/or indicates the name of covariance matrix files for other parameters.
fr: Un fichier d'incertitude des paramètres (.unc). Il contient des déviations standard pour des paramètres individuels que ne sont corrélés à d'autres paramètres et/ou indique le nom de la matrice de covariances pour les autres paramètres.

source: A single prior covariance matrix file (.cov). It contains a covariance matrix of all the model's parameters. The file is written according to the PEST matrix file specifications.
fr: Un unique fichier de matrice de covariances a priori (.cov). Il contient une matrice de covariances de tous les paramètres du modèle. Le fichier est écrit d'après les spécifications du fichier de matrice de PEST.

source: A binary covariance matrix file (.jco or .jcb). It is a file used by PEST++ to write a Jacobian matrix.
fr: Un fichier binaire de matrice de covariances (.jco or .jcb). C'est un fichier utilisé par PEST++ pour écrire une matrice de Jacobi.

source: For more information on the specification of these types of file see the PEST++ user guide.
fr: Pour plus de renseignements sur la spécification de ces types de fichier voyez le manuel d'utilisation de PEST++.

source: If an uncertainty file is not provided, parameter uncertainty is estimated from the parameter bounds by assuming the interval covers 4 standard deviations.
fr: Si un fichier d'incertitude n'est pas donné, l'incertitude des paramètres est estimée depuis les limites des paramètres en supposant que l'intervalle couvre 4 déviations standard.

source: Carry the analyses
fr: Réalisation des analyses
